{
  "sessions": [
    {
      "id": "2d8010f1-62cc-4540-82c2-e5e9a0f57804",
      "title": "Check-In & Registration",
      "description": null,
      "startsAt": "2023-04-27T08:00:00",
      "endsAt": "2023-04-27T09:15:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "461143",
      "title": "Android Graphics: the Path to [UI] Riches",
      "description": "Android's graphics APIs are extensive and powerful... but maybe a little complicated. This session will show ways to use the graphics APIs to achieve cool effects and improve the visual quality and richness of your applications.",
      "startsAt": "2023-04-27T09:15:00",
      "endsAt": "2023-04-27T10:00:00",
      "speakers": [
        "05fa719f-1528-43ef-adf9-eca92f383262",
        "152f613f-841b-407d-9a65-3703ec2dfae2"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158844,
        158845,
        158847
      ],
      "isServiceSession": false
    },
    {
      "id": "cbfbf549-ac89-419a-9c13-506e09bb354a",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-27T10:00:00",
      "endsAt": "2023-04-27T10:30:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "433220",
      "title": "Using Compose Runtime to create a client library",
      "description": "Jetpack Compose (UI) is a powerful UI toolkit for Android. Have you ever wondered where this power comes from? The answer is Compose Runtime. \r\n\r\nIn this talk, we will see how we can use Compose Runtime to create client libraries. Firstly, we will talk about Compose nodes, Composition, Recomposer, and how they are orchestrated to create a slot table. Then, we will see how the changes in the slot table are applied with an Applier. Moreover, we will touch upon the Snapshot system and how the changes in the state objects trigger a recomposition. Finally, we will create a basic UI toolkit for PowerPoint using Compose Runtime.",
      "startsAt": "2023-04-27T10:30:00",
      "endsAt": "2023-04-27T11:15:00",
      "speakers": [
        "5f7faf69-dd61-4ad6-b6d8-0173cae292d8"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "457041",
      "title": "En quête de perf: l'art subtile du profiling Android",
      "description": "Comment enquêter sur un problème de performance? Google a publié de nombreux outils d'investigation très puissants, mais aussi très intimidant. La première fois que j'ai ouvert Perfetto, j'ai  rigolé puis refermé la page immédiatement.\r\n\r\n Par ou commencer? Quel signaux faut t'il regarder, quand, et quelle conclusion en tirer? Comment choisir le bon outil de profiling adapté à une situation?\r\n\r\nCette session vous présente une approche systématique et concrète pour analyzer des problèmes de performance d'applications Android, en utilisant les bons outils de profiling dans le bon ordre.",
      "startsAt": "2023-04-27T10:30:00",
      "endsAt": "2023-04-27T11:15:00",
      "speakers": [
        "a733fc42-dcb9-4107-9675-70335f2889e9"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "432816",
      "title": "Demystifying the test pyramid",
      "description": "Back in 2010, Mike Cohn in his \"Succeeding with Agile\" book, introduced the pyramid of tests. Since then, it has been criticized (mostly for being unsuitable for many real life situations), slightly updated, but its core concept is still seen in many articles. So what value can we get out of the test pyramid, and how can you adapt it to better fit with your use cases, workflows and setup.\r\n\r\nAfter explaining the original concept of the testing pyramid, we will discuss its pitfalls and caveats, then provide more depth and a new perspective on this tool while providing tips and guidelines that engineers can use to improve their test suites. \r\n",
      "startsAt": "2023-04-27T10:30:00",
      "endsAt": "2023-04-27T11:15:00",
      "speakers": [
        "bf58d77f-fad3-49b7-a6b3-82b5f46e5549"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "454563",
      "title": "Developing system apps without AOSP",
      "description": "If you work with Android development long enough, there is a high chance that you eventually will be developing system applications for a custom Android device. This is quite different from doing regular apps we publish on Google Play Store, and used to require that you have the entire AOSP source code checked out in order to work with it. \r\n\r\nHowever, with some understanding of how Android internals work and how to use some undocumented features of the regular build tools, we can actually develop system apps without the whole mess that comes with AOSP.\r\n\r\nIn this session you'll learn how to use system and signature level permissions, how to efficiently call system APIs, and how to test all of this on a regular Android emulator. Hopefully this will make the daily life easier for all the Android developers working on system applications.",
      "startsAt": "2023-04-27T10:30:00",
      "endsAt": "2023-04-27T11:15:00",
      "speakers": [
        "79823093-1b16-4a2b-b0a9-ea4cd25b92f5"
      ],
      "roomId": 33634,
      "categoryItems": [
        158838,
        158843,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "456474",
      "title": "Help! What is my place in the IC vs. EM career path?",
      "description": "I will take you on a journey of the different career evolution opportunities that I had on my professional experience, be it on an Agency or with a client: developer, Lead Dev, Tech Lead, Scrum Master, Point of Contact, Team Leader, Developer Advocate, Core Team, Lead Chapter, Senior Staff Engineer... Behind all those titles (that I had in a official or non-official way), I could see an evolution on the company's organizations that are looking more and more add value to technical careers and develop a tech culture. Moreover, the definitions and expectations can vary from one company to another. One trend is clear: one path is oriented on technical expertise (Individual Contributor) and another is oriented on people management (Engineering Management), but... how to proceed if we want to do a little bit of both? I may have found the answer and I will explain to you on this talk!",
      "startsAt": "2023-04-27T11:25:00",
      "endsAt": "2023-04-27T11:45:00",
      "speakers": [
        "7c888e22-f254-4e04-aa56-1853ab18c000"
      ],
      "roomId": 31079,
      "categoryItems": [
        158837,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "455615",
      "title": "Clean Code Base: Harnessing the Power of Android Lint and Custom Rules",
      "description": "As Android developers, we all know the importance of writing clean and maintainable code. However, as our codebase grows, it becomes increasingly difficult to ensure that all developers are following the same coding standards. That's where Android Lint comes in.\r\n\r\nAndroid Lint is a powerful tool that can help us catch a wide range of potential issues in our codebase. Lint can save us hours of debugging time by identifying issues early on. But did you know that you can also create your own custom Lint rules?\r\n\r\nIn this talk, we'll dive deep into the world of Android Lint and explore how to create custom rules that fit our specific needs. We'll cover the basics of how Lint works, the different types of rules that we can create, and some practical examples of how to use Lint to improve code quality at scale.\r\n\r\nBy the end of this talk, you'll have a solid understanding of how to use Android Lint to improve code quality and productivity on your projects. You'll be equipped with the knowledge to create your own custom rules and ensure that your codebase is clean and maintainable at all times.",
      "startsAt": "2023-04-27T11:25:00",
      "endsAt": "2023-04-27T11:45:00",
      "speakers": [
        "9a7f5add-ce7a-49a3-ab3d-f3c4484453e8"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "455769",
      "title": "The joys and challenges of building a paywall with BillingClient 5",
      "description": "With Google I/O '23 approaching, the time to migrate to Google Play Billing Library 5 (PBL5) is halfway done. There are good reasons to migrate sooner, rather than later, though:\r\n\r\nIn this talk, you'll learn how the flexibility offered by BillingClient 5 enables new paywall configurations and functionality, with working examples for you to implement yourself. We'll also highlight the challenges we ran in while upgrading the RevenueCat library to support these changes, many of which are incredibly relevant if you're one of the hundreds of thousands of Android apps that still need to migrate to PBL5.\r\n\r\nYou'll leave the talk with a better understanding of real-world implementations of Billing Library 5, its benefits and its challenges, setting you up for a more successful migration down the road.\r\n",
      "startsAt": "2023-04-27T11:25:00",
      "endsAt": "2023-04-27T11:45:00",
      "speakers": [
        "944b39a5-752a-40e4-aa2b-dcc8e0f6da38",
        "1fcef224-ed23-4d8d-8e07-4855817796fd"
      ],
      "roomId": 31081,
      "categoryItems": [
        158837,
        158842,
        158845,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "454815",
      "title": "Tauri / Dioxus : ces nouveaux frameworks Rust qui veulent faire du mobile",
      "description": "Pour remplacer ElectronJS (basé sur Chromium), des nouvelles alternatives écrites en Rust se sont multipliées comme Tauri et Dioxus.\r\n\r\nDans ce talk, nous verrons ce que permettent ces nouveaux frameworks et s'ils sont prêts à faire du mobile et ainsi concurrence Flutter et React Native.",
      "startsAt": "2023-04-27T11:25:00",
      "endsAt": "2023-04-27T11:45:00",
      "speakers": [
        "b88bee58-a4e3-4a47-be4d-85c9421457cc"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158841,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "430933",
      "title": "Staying passionate about your craft",
      "description": "Like projects, careers aren't static and they definitely have their ups and downs. And while work isn't the most important thing in life, it does take up a sizeable amount of our time. So how can you remain excited to go to work every morning?\r\n\r\nIn this talk, Jeroen will reflect back at his decade long software development career. We'll have a laugh at all the poor choices he made, see how luck tends to shape the most pivotal moments and even have an open conversation about the absolute lows.\r\n\r\nFrom leading a 14+ people team, to becoming a GDE, starting his own business, doing remote work being 9(!) timezones ahead and having three lovely children... It makes for an interesting story, but not a silver bullet to a happy career. Hopefully though, Jeroen can shed some light on how to make",
      "startsAt": "2023-04-27T11:50:00",
      "endsAt": "2023-04-27T12:35:00",
      "speakers": [
        "b3770b77-c9c8-454d-8b7a-045ca1d66b7b"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "434436",
      "title": "Forging the path from monolith to multi-module app",
      "description": "Going from a monolith to a multi-module project is a long process, that requires careful planning and a well-thought through strategy, especially in medium-large teams.\r\n\r\nThe TIER application is evolving to a multi-module structure and this talk will be the logbook of the journey, covering the approach that we followed and the philosophy behind the choices that we’ve made with both the mobile platforms in mind.\r\n\r\nI will tell you how to balance the entire process without harming the regular feature delivery schedule, where to start modularising, and improvements to the build tools to make life less miserable.",
      "startsAt": "2023-04-27T11:50:00",
      "endsAt": "2023-04-27T12:35:00",
      "speakers": [
        "aeddc24f-0e47-4934-ad76-2de7a9dc9fac"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "464671",
      "title": "How Wildlife Studios maximizes mobile game performance and discoverability",
      "description": "Wildlife Studios, one of the world’s largest and most successful mobile game studios, has more than 60 mobile games in their portfolio, across Android and iOS. Whether they’re launching new titles or shipping updated content to live games, they’ve built their reputation on their ability to continually delight users with some of the best mobile experiences in gaming. \r\n\r\nKey to maximizing game quality and organic discoverability is meeting the strict technical requirements of The App Store and Google Play — not an easy feat when delivering cutting-edge experiences to a diverse, worldwide audience.\r\n\r\nIn this presentation, Wildlife Studios Manager of Engineering Operations, Lucas Klegen, shares how his teams maximize and maintain high technical performance at scale, including how they’re: \r\n\r\n- Keeping games consistently below the Google Play Console bad behavior thresholds.\r\n- Increasing the frequency in which games are featured across The App Store and Google Play.\r\n- Leveraging best-in-class insights to focus on actual issues and not false alarms. \r\n- Anticipating issues before having to hear about them from players.",
      "startsAt": "2023-04-27T11:50:00",
      "endsAt": "2023-04-27T12:35:00",
      "speakers": [
        "bd3e3257-9d05-4f72-9225-50908473778d"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "429911",
      "title": "Collapsing toolbar with parallax effect and curved motion in Jetpack Compose",
      "description": "Animations are super important when building an application. They highlight relations between elements, bring attention to what is important and they also can express a brand style.\r\n\r\nIn this talk, I’ll show you how to implement a collapsing toolbar with parallax effect in jetpack compose only (no third party library). I’ll also show you how to implement curved motion using  the power of quadratic Bézier curve which is already ubiquitous in game development but now become so accessible in Jetpack Compose.\r\n\r\nSo if you want to learn how to build any custom linear animations, or animate objects along a curved path in Compose, without impacting performance, join in 😎",
      "startsAt": "2023-04-27T11:50:00",
      "endsAt": "2023-04-27T12:15:00",
      "speakers": [
        "ca3e1da2-cfce-4823-8e14-a886f2483c2c"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158842,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "6ef3a0b9-9aa5-464c-aa80-10bd2f12c649",
      "title": "Lunch",
      "description": null,
      "startsAt": "2023-04-27T12:35:00",
      "endsAt": "2023-04-27T13:50:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "469867",
      "title": "Exposing Data",
      "description": "Exposed is a lightweight open source library built from the ground up using Kotlin. It provides you with two ways of interacting with relational data - either using a Data Access Object approach, or via a DSL that provide strongly-typed SQL-like syntax. In this presentation we'll cover the basics of Exposed and how to get up and running with it, no matter the approach used. We'll bake into real-world usage scenarios by combing it with a server-side application built in Ktor.",
      "startsAt": "2023-04-27T13:50:00",
      "endsAt": "2023-04-27T14:35:00",
      "speakers": [
        "3ff1f933-847b-4e0d-8e01-c2ca21bbab5d"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "423061",
      "title": "SwiftUI vs Jetpack Compose par un Ingénieur Android",
      "description": "En tant que ingénieur Android, Jetpack Compose est une révolution. La confection des interfaces, la maintenance du code et la compatibilité avec les plus vieilles versions d’Android sont seulement quelques points qui font de cette librairie l’une des plus incontournables de la suite Jetpack. Mais du côté de la pomme, SwiftUI s’est aussi imposé comme une alternative incontournable dans le développement d’interface pour les appareils Apple.\r\n\r\nJe vous propose de monter sur le ring et de mettre face à face SwiftUI à ma droite et Jetpack Compose à ma gauche. Nous allons comparer leur design, leur usage, leurs différences et leurs perspectives pour avoir un vainqueur et voir qui remporte ce match.\r\n\r\nPrenez pop-corn et mauvaise foi, il va y avoir du sang !",
      "startsAt": "2023-04-27T13:50:00",
      "endsAt": "2023-04-27T14:35:00",
      "speakers": [
        "6520ad1e-8c4e-45c1-b34d-91ca73db27fe"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158841,
        158846,
        158849,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "456540",
      "title": "Designing for foldables in 2023",
      "description": "With the increasing number in the market of foldable and large screen devices, Designers and Developers need to pay special attention to optimizing their apps for each screen resolution and state and ensure an optimal user experience, no matter the device that is used.\r\n\r\nIn this session, we’ll look at key design principles for adaptive layouts and best practices when designing and building apps for different screen sizes.\r\nWe’ll also explore the key aspects of canonical layouts and their applications to real products. \r\n\r\n",
      "startsAt": "2023-04-27T13:50:00",
      "endsAt": "2023-04-27T14:35:00",
      "speakers": [
        "2f606e32-997a-4b74-8420-76a47e7d66a3",
        "97bc557b-01db-4ffc-813c-2c4c1a99500c"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158842,
        158845,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "864c40a7-bbf1-490b-8fab-312911ddbdec",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-27T14:35:00",
      "endsAt": "2023-04-27T14:50:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "453896",
      "title": "90s Website …  in 2023 on mobile in Compose … for science",
      "description": "Why  would anyone build something with a 90s website aesthetic - in Compose? Nostalgia? For one the 90s website aesthetic made heavy use of animations and visual effects. So emulating this style will take any animation framework through its paces. This talk will take some of the most iconic 90s website elements and demonstrate how to reproduce them to build  a retro mobile experience using Jetpack Compose. \r\n\r\nI can’t promise the end result will have a good user experience but I can promise a good look at the animation system in Compose and a collection of cheesy code snippets.",
      "startsAt": "2023-04-27T14:50:00",
      "endsAt": "2023-04-27T15:35:00",
      "speakers": [
        "2313d8eb-7d6e-444d-8e8d-4d223f896ce8"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158845,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "419284",
      "title": "Collaborating with Protobuf & Type-Safe APIs",
      "description": "Collaboration across different stacks is complicated both within teams and across organizations. In this talk, we'll explore a real world case study: How Protobuf was integrated at Lyft (a U.S. ride-share company) and how it unlocked code generation to help improve the development experience and velocity for engineers working together across platforms. At the end of this talk, you'll be equipped with the understanding of how to use Protobuf to easily improve your development workflow.",
      "startsAt": "2023-04-27T14:50:00",
      "endsAt": "2023-04-27T15:10:00",
      "speakers": [
        "e79f9a2d-dd0a-4e40-bd83-57abdcc07147"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "422755",
      "title": "AI won't take your job but it sure will help you do it better",
      "description": "Get your code generation and suggestion tasks done in a jiffy with AI!\r\n\r\nIn this session, we'll demonstrate how to use Github's Co-Pilot and chat GPT to automate the creation of code for data classes, services, and repositories. You'll see firsthand how these tools can save you time and effort by generating boilerplate code for you.\r\n\r\nWe'll also show you how to use these tools to create pull requests and Jira tickets with ease. \r\n\r\nTo round out the session, we'll live code an Android app that uses the OpenAI API to find the perfect GIF for any message.\r\n\r\nJoin me to discover how AI can make your programming life easier and more enjoyable. You'll leave the session with a set of new tools and techniques to help you get your code done faster and more efficiently.\r\n\r\nOh and yes, this description was written by a.i.",
      "startsAt": "2023-04-27T14:50:00",
      "endsAt": "2023-04-27T15:35:00",
      "speakers": [
        "3192eb25-047c-4d7e-874a-53206c185074"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "455254",
      "title": "Embarquer votre modèle de machine learning dans votre app ?",
      "description": "Comment exécuter des modèles d'apprentissage automatique sur téléphone ? Comment télécharger le modèle et les données supplémentaires ? Est-ce que cela fonctionne bien ? Même dans une application React Native ?\r\n\r\nPl@ntNet dispose d'un modèle d'identification hors ligne/embarqué qui a été directement créé à partir de notre modèle de production côté serveur.\r\nNous avions besoin de télécharger le modèle, ainsi que les informations et les noms des espèces de plantes que nous ne voulions pas rendre facilement lisibles par d'autres. Mais nous souhaitions également disposer de données supplémentaires telles que des images d'illustration.\r\nNous avons eu quelques problèmes de mise en place, nous allons donc approfondir l'implémentation dans React Native avec un peu de code natif sur Android/iOS (java/swift).\r\n\r\nEnfin, est-ce que cela fonctionne bien ? Comment se compare-t-il à notre processus côté serveur ? ",
      "startsAt": "2023-04-27T14:50:00",
      "endsAt": "2023-04-27T15:10:00",
      "speakers": [
        "60549250-148e-46a0-9868-f5d31b5f7499"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158842,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "445351",
      "title": "How to use hardware acceleration for Machine Learning inference on Android",
      "description": "The rising processing power of Android devices unlocks on-device machine learning capabilities unthinkable a few years ago.\r\n\r\nTo enable machine learning real-time experiences (augmented reality filters, live speech transcription, etc…) you need to accelerate ML processes. TensorFlow Lite on Android can leverage specialized hardware available on the device (GPU, DSP, NPU, etc…).\r\n\r\nIn this session we will explain how to use Acceleration delegates and new TensorFlow Lite Android APIs to enable ML hardware acceleration.\r\n\r\n#tflite #ML #AI #gpu #performance",
      "startsAt": "2023-04-27T15:15:00",
      "endsAt": "2023-04-27T15:35:00",
      "speakers": [
        "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
        "791d1128-88d2-4f3f-9917-9e4c1f1ea961"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "455750",
      "title": "Tests unitaires avec KotlinFlow",
      "description": "Lorsque nous développons une fonctionnalité, nous devons écrire les tests unitaires. C'est une partie essentielle du développement. Cela assure le bon fonctionnement du code lors de futurs changements ou refactorisations.\r\n\r\nKotlin Flow ne fait pas exception. Nous avons besoin de tester le fonctionnement de nos flux de données. \r\n\r\nTandis que nous verrons la facilité de tester un Flow, quand les delays sont utilisés, que les différents context de coroutines s'en mêlent, on peut sentir les migraines arrivées...\r\n\r\nMais, avec kotlinx-coroutines-test, Kluent et Turbine, écrire des tests unitaires succincts et lisibles reste facile et simple.",
      "startsAt": "2023-04-27T15:15:00",
      "endsAt": "2023-04-27T15:35:00",
      "speakers": [
        "f63fcbea-0846-4b5e-b174-e1e9a5359964"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158841,
        158846,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "da60a02c-c5e7-409e-8858-c7e45e9583f4",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-27T15:35:00",
      "endsAt": "2023-04-27T15:50:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "454972",
      "title": "Unusable or Undebuggable? Rebelling against \"best practices\"",
      "description": "Thanks to new Compose libraries, making a good looking Wear OS app is becoming very easy!\r\n\r\nHowever, on the watch, if you need to scroll, LazyColumn gives you 5-10 frames per second at best in debug mode.\r\n\r\nUnusable? Unacceptable!\r\n\r\nActually, I noticed the scrolling performance wasn't that great in debug on the phone too, so I went on to fix this, succeeded, and got bonus features I missed in LazyColumn!\r\n\r\nYou'll learn the full story and see how it's all implemented.",
      "startsAt": "2023-04-27T15:50:00",
      "endsAt": "2023-04-27T16:10:00",
      "speakers": [
        "7c1cede6-5f59-46bb-ad1e-22b63758dae7"
      ],
      "roomId": 31079,
      "categoryItems": [
        158837,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "454421",
      "title": "Going on a road trip with Android Auto",
      "description": "Android is truly everywhere. It's running on the phone, watch, TV, car, and there are even some fridges and toasters that want to be part of the family. While they're still under development, Android Auto is starting to gain a lot of adoption.\r\n\r\nIn this talk, we're going to travel around the road of Android Auto, see its use cases and go through its functionalities, so you can later implement them on your app. All of this without moving your desk to be inside a car.\r\n\r\nJump in, it's going to be an amazing journey.",
      "startsAt": "2023-04-27T15:50:00",
      "endsAt": "2023-04-27T16:10:00",
      "speakers": [
        "2bc1e95f-1243-4ad0-8a11-75541fee10e0"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158841,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "454627",
      "title": "Comment gagner en efficacité avec les file templates ?",
      "description": "Android Studio est basé sur IDEA. Cela signifie que nous avons accès aux live et file templates des IDE d'IntelliJ. L'intérêt est de produire le code répétitif en quelques touches.\r\n\r\nLe but de cette présentation : vous convaincre que les file templates sont une solution viable pour accélérer une partie du développement !\r\n\r\nCe que vous allez apprendre:\r\n- Qu'est-ce qu'un file template ?\r\n- Comment générer plusieurs fichiers ?\r\n- Comment les utiliser sur MVVM Compose ou Room ?",
      "startsAt": "2023-04-27T15:50:00",
      "endsAt": "2023-04-27T16:10:00",
      "speakers": [
        "13e3361f-310d-4d75-a593-bb3acfee08a7",
        "424072c4-ac7b-45e0-9d63-34903356b74c"
      ],
      "roomId": 31081,
      "categoryItems": [
        158837,
        158842,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "441771",
      "title": "I have a Date",
      "description": "One common task in Android app development is working with Date object, and Kotlin provides several options for managing it. In this talk, we will explore the different ways to represent and manipulate dates in Kotlin, including using the built-in java.util.Date class, the third-party Joda-Time library, and the java.time package introduced in Java 8. We will also discuss best practices for formatting and displaying dates to the user, and handling time zones and daylight saving time. By the end of this talk, attendees will have a strong understanding of how to effectively manage dates in their Kotlin Android apps.",
      "startsAt": "2023-04-27T15:50:00",
      "endsAt": "2023-04-27T16:10:00",
      "speakers": [
        "4674e36f-50f8-4ffb-a486-679d730c759e"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "441542",
      "title": "The Rise and Fall of Feature Teams",
      "description": "At some point, organizations scale up – they move their platform teams to a setup with cross-functional teams. From now on designers, backend and mobile developers will work together day by day instead of waiting for each other. You will have all the resources you need within your team. And it makes sure that everyone in your team is working on the same thing, preventing isolated islands or working at different speeds, the perfect knowledge-sharing approach,\r\nWhat if I tell you that in practice this promising world often collapses and at least leads to a new world of problems you have to deal with now? Was it just a nice dream that can turn into a nightmare?\r\n\r\nAt SoundCloud we went through these setups, we worked like this and we realized it wasn't helping us in the way we wanted. Let me tell you why and what where we ended up with now!\r\n",
      "startsAt": "2023-04-27T16:15:00",
      "endsAt": "2023-04-27T16:35:00",
      "speakers": [
        "4d3a31b1-61e5-4a26-9ca3-c9f30e3eaa08"
      ],
      "roomId": 31079,
      "categoryItems": [
        158837,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "442026",
      "title": "Become a Maestro of Mobile Testing in 5 minutes",
      "description": "Maestro is the latest tool of the mobile.dev team (former Uber mobile platform engineers). \r\n\r\nThe concept is simple: adopt the shift left on your mobile app to prevent problems in production. \r\n\r\nWe will present a brief introduction of this tool that allows you to build end to end tests in a breeze without knowledge of any end to end test technologies. \r\n",
      "startsAt": "2023-04-27T16:15:00",
      "endsAt": "2023-04-27T16:35:00",
      "speakers": [
        "05385600-cf94-4333-afb3-0ebb5f9d0269",
        "22ac76a5-35b4-478c-a2c6-f7b8a4169928"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "424855",
      "title": "Réaliser rapidement un jeu cross-platform avec Flutter et Firebase",
      "description": "Dans ce workshop nous allons voir les bases de Flutter et de Firebase à l'aide d'un petit jeu.\r\n- Création d'un projet Flutter\r\n- Création d'un petit jeu simple à l'aide de Widgets de base afin de découvrir Flutter\r\n- Connexion à un projet Firebase\r\n- Ajout des résultats des parties dans une collection Firestore\r\n- Utilisation de Firestore pour voir les résultats de la partie en direct\r\nA la fin de cette workshop, vous aurez un aperçu des composants de base de Flutter ainsi que les possibilités qu'offre Firebase et Firestore pour facilement ajouter des fonctionnalités à une application Flutter.\r\n",
      "startsAt": "2023-04-27T16:15:00",
      "endsAt": "2023-04-27T17:35:00",
      "speakers": [
        "3d34325b-8080-415c-9324-b06d036c5cab"
      ],
      "roomId": 31081,
      "categoryItems": [
        158839,
        158841,
        158846,
        158848,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "452498",
      "title": "Make Gradle work for you, create your own tasks and plugins",
      "description": "As Android developers, we often interact with build.gradle(.kts) and settings.gradle(.kts) to build our apps with Gradle. Sometimes, we add a plugin that magically provides us with some needed features (aka Tasks) without knowing how it works under the hood. \r\n\r\nDiscover the power of Gradle and how you can script some manual and painful tasks to make Gradle work for you.\r\n\r\nDuring this presentation, you will learn:\r\n\r\n- What is a Task, and how to create your own\r\n- What is a Plugin, and how to create your own\r\n- Provide a nice DSL to configure your tasks\r\n- How to publish your plugin",
      "startsAt": "2023-04-27T16:15:00",
      "endsAt": "2023-04-27T16:35:00",
      "speakers": [
        "a20010e8-b898-465f-84c8-69d93ae46194",
        "23c58f10-a1d1-4c3d-aa8c-caed84503b97"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "b08dd7ed-1371-4cf6-96e9-a5f37a54df4e",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-27T16:35:00",
      "endsAt": "2023-04-27T16:50:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "442732",
      "title": "Practical ADB usage to enhance your life!",
      "description": "ADB is an incredibly underutilized tool that can dramatically improve your Android development experience! Maybe you know some basic ADB commands, perhaps even a couple of nifty advanced ones or possibly, you don’t know what ADB even is!\r\n\r\nImagine automatically & swiftly logging into your app’s test account, instantly inspecting your app’s current Activity/Fragment stack or editing your app’s shared preferences & phone settings all without touching your device! All this and SO MUCH MORE is possible thanks to ADB.\r\n\r\nThis session is not intended to blast you with a list of ADB commands but instead to share a collection of practical scenarios & examples how you can use this supreme tool everyday in a variety of ACTUALLY useful ways. \r\n\r\nJoin me in this session, regardless of your experience, as we explore what this tool can really do to change the way you work forever!",
      "startsAt": "2023-04-27T16:50:00",
      "endsAt": "2023-04-27T17:35:00",
      "speakers": [
        "5f8860b3-e669-4717-91bf-ddceb872fd55"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "436372",
      "title": "Go with the Flow",
      "description": "Kotlin Flow is an implementation of Reactive Stream specification made on top of coroutines for Kotlin.\r\n\r\nIn this talk, we will look at Kotlin Flow, it's internals, how to use it with on Android or any other platforms, and share how you can migrate to Flow\r\n\r\nAgenda\r\n- Quick intro to Flow\r\n- Internals of Kotlin Flow\r\n- Using Flow on Android and other platforms\r\n- Why and how to migrate\r\n- Working with existing reactive streams ❤ Flow in single codebase\r\n- Magic of multi-platform\r\n- Tests\r\n- Conclusion\r\n\r\nYou’ll walk away with a clear idea of what Kotlin Flow and how it works internally and how you can level up your reactive game",
      "startsAt": "2023-04-27T16:50:00",
      "endsAt": "2023-04-27T17:35:00",
      "speakers": [
        "a82de654-53d7-4c16-989a-5efddf36983e"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "418036",
      "title": "Let's shake the Flutter tree",
      "description": "The more platforms a Flutter application supports, the more code a project can have that is needed only for one platform and not needed for others. How to make sure that unnecessary code does not get into the final platform-specific build? And how to check that it really did not get?\r\n\r\nIn Flutter, there is a Tree-shaking mechanism, which is designed exactly for these purposes. Many Flutter developers have heard about it, but not everyone really understands what it is and how it actually works. Let's try to figure it out.",
      "startsAt": "2023-04-27T16:50:00",
      "endsAt": "2023-04-27T17:35:00",
      "speakers": [
        "c73c2377-026f-4b6a-b1f7-91a536c33c67"
      ],
      "roomId": 33634,
      "categoryItems": [
        158838,
        158842,
        158845,
        158848
      ],
      "isServiceSession": false
    },
    {
      "id": "6ae29154-bed0-4ddb-8a73-b6135b0e27e1",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-27T17:35:00",
      "endsAt": "2023-04-27T17:50:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "455494",
      "title": "Un Design System, ça se Compose !",
      "description": "Depuis la publication de la première version stable Jetpack Compose il y a près de 2 ans, l’intérêt pour cette technologie n’a fait qu’augmenter, et son adoption dans les nouveaux projets est une évidence. Cependant, son intégration dans des projets ayant des codebases conséquentes et anciennes est une autre affaire.\r\n\r\nChez Deezer, nous travaillons depuis plusieurs années avec un Design System afin d’améliorer la productivité et la consistance de nos projets. Aussi, la synergie entre Compose et les Design Systems, grâce à la composition, nous est apparue comme une excellente opportunité pour accélérer nos futurs développements et créer de nouvelles interfaces saisissantes. Nous avons, par conséquent, établi une stratégie afin de migrer notre Design System et utiliser Compose pour nos nouvelles implémentations, mais aussi de migrer nos fonctionnalités existantes. En voici les différentes étapes : \r\n- Migration d'une page existante afin de monter en compétence sur les nouveaux paradigmes introduits par Compose\r\n- Définition d’une roadmap visant à initier un nouveau Design System en Compose, en suivant les principes de l’Atomic Design\r\n- Conception de l’API de nos composants afin de les rendre à la fois flexibles et réutilisables, notamment sur l’usage d’API par “slot” ou encore de modèles pour les composants UI\r\n- Spécifications des guidelines et standards, à la fois pour l’usage du nouveau Design System mais aussi pour les nouveaux développements en Compose\r\n\r\n\r\nNotre retour d'expérience vous permettra de découvrir différentes solutions, de mieux comprendre les pièges à éviter (dans lesquels nous sommes parfois tombés), et d’imaginer quelle stratégie adopter pour migrer vos propres applications en Compose.\r\n",
      "startsAt": "2023-04-27T17:50:00",
      "endsAt": "2023-04-27T18:35:00",
      "speakers": [
        "d74d249a-ce9e-4887-93a0-fa19d73a501d",
        "8e90a4dc-33fc-4000-9bcb-802e45b50d87"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "456538",
      "title": "Journey of the Android white label process",
      "description": "White labelling is an integral process for customising on-demand solutions at ioki. We have 80 modules in-app and 70+ projects being released biweekly, a number that is ever-growing! With an increasing number of features and code, we need to separate responsibilities between the core feature-driven app and the white-label projects, while optimising for scalability. \r\n\r\nDuring this talk, we will discuss\r\n- how Android platform features like modularisation, product flavors and resource overriding can shape the white labelling pipeline,\r\n- how we can continuously evolve our project architecture to fit team and product requirements,\r\n- how to isolate the core features of an app from the customisation process, and\r\n- what makes for a successful run to a new white-label project release!",
      "startsAt": "2023-04-27T17:50:00",
      "endsAt": "2023-04-27T18:35:00",
      "speakers": [
        "c35f2359-2c5c-4b88-a4bc-024a6c025ce4"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "fd36b22f-dd2a-414c-806f-fdad9d68b14b",
      "title": "(Cont. from 4:15 session start) Réaliser rapidement un jeu cross-platform avec Flutter et Firebase",
      "description": "Workshop session continued.",
      "startsAt": "2023-04-27T17:50:00",
      "endsAt": "2023-04-27T18:35:00",
      "speakers": [
      ],
      "roomId": 31081,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "433488",
      "title": "Take a look at Jetpack Glance",
      "description": "Jetpack Glance is the new shiny library in the Jetpack family for creating widgets. At first glance, it resembles a Jetpack Compose, but in many cases, it is really different. Learn those differences and create beautiful widgets easily.\r\nDuring this talk, I will describe how the Jetpack Glance works, what are the differences between it and RemoteViews widgets. You will also learn why we still need some XMLs, how to manage the state, and periodic updates.",
      "startsAt": "2023-04-27T17:50:00",
      "endsAt": "2023-04-27T18:35:00",
      "speakers": [
        "b6dc4b56-ca5d-4e55-8a57-e37f6e6d6af0"
      ],
      "roomId": 33634,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "dbc9fca5-44e0-4873-914f-4525fad5a0e3",
      "title": "Party",
      "description": null,
      "startsAt": "2023-04-27T19:00:00",
      "endsAt": "2023-04-27T20:00:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "52ca2f2c-31ac-492c-88fe-50f92084a797",
      "title": "Check-in & Registration",
      "description": null,
      "startsAt": "2023-04-28T08:30:00",
      "endsAt": "2023-04-28T09:20:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "6ffcdfcd-4967-40a3-8463-fca33e654d74",
      "title": "Opening",
      "description": null,
      "startsAt": "2023-04-28T09:20:00",
      "endsAt": "2023-04-28T09:30:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "452238",
      "title": "What a Long Strange Trip it's Been: A Year In Android",
      "description": "The Android community is a fast evolving society of excellent people who passionately involve themselves in their ecosystem. This means the progress of developments can be fast, blazingly fast! \r\n\r\nInspired by other content creators and newsletters that keep us informed about the most recent events, I decided to document news, events, and releases every week for a year. Starting from the end of Droidcon Berlin, the world’s best Android developer conference.\r\n\r\nAccompany me in this journey to look over all the events of this last year, from the end of Droidcon Berlin 2022 up until right now!",
      "startsAt": "2023-04-28T09:30:00",
      "endsAt": "2023-04-28T10:15:00",
      "speakers": [
        "10659767-356c-4cd5-ba9c-12cec7a3ce79"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158841,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "48935f5b-4e47-4a6d-81cc-74fa7520ce7f",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-28T10:15:00",
      "endsAt": "2023-04-28T10:40:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "419559",
      "title": "Sweet Architecture",
      "description": "How about unidirectional data flow in an architecture where views and presenters don’t know about each other? While growing up to 40+ engineers and 600+ modules, Cash App managed to control the complexity of its product. Views can be written in either Kotlin or XML; presenters with either Rx, Coroutines, or Compose; no problem. We test views on the JVM and we don’t need to define fake presenters either.\r\n\r\nWriting new screens is delightful and we’ll see how we made it possible by:\r\n- Looking at the foundations of the architecture: our internal navigation library which allows clear modularity,\r\n- Checking how it can adapt to presenters using different technologies,\r\n- Explaining how views are defined and tested,\r\n- Seeing how everything is glued together from a bird’s-eye view of the app.\r\n\r\nGrowing your app and team doesn’t imply more pain nor more complexity. Attendees will gain a sound understanding about how we achieved it.\r\n",
      "startsAt": "2023-04-28T10:40:00",
      "endsAt": "2023-04-28T11:25:00",
      "speakers": [
        "449b4215-55cc-444f-8ff4-b0c434a96019"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "454848",
      "title": "How to ship apps better, faster, stronger",
      "description": "Shipping mobile apps has evolved a lot over the past decade. This session will go over the latest best practices in terms of Continuous Delivery for mobile: How to ship apps continuously? How to use Feature Flags to release safely? Which branching strategy to use? How to monitor a release once it's shipped?",
      "startsAt": "2023-04-28T10:40:00",
      "endsAt": "2023-04-28T11:25:00",
      "speakers": [
        "0b1323da-2946-49de-be5c-e54d44e12325"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "446247",
      "title": "Let's discover the possibilities of Kotlin beyond Android",
      "description": "You're already developing Android apps with Kotlin ? Then, you're not far from being a FullStack and cross-platform developer. \r\n\r\nIndeed, the Kotlin ecosystem is versatile, allowing to develop many types of apps such servers, CLIs, Desktop apps and mobile apps, etc.\r\n\r\nIn this this coding workshop, we'll explore some possibilities of the Kotlin ecosystem outside of pure Android development. More specifically, we'll create these apps:\r\n\r\n- A REST API Server with KTOR\r\n- A Cross-platform web app with Compose Multiplatform\r\n- A Cross-platform Desktop / Android app with Compose Multiplatform\r\n- An cross-platform iOS / Android library with KMM\r\n\r\nHere are the prerequisites:\r\n- IntelliJ IDEA Community or Ultimate edition\r\n- Android Studio with the KMM plugin\r\n\r\nThe workshop material is available online: https://worldline.github.io/learning-kotlin. The source code of the workshop is available on GitHub: https://worldline.github.io/learning-kotlin/",
      "startsAt": "2023-04-28T10:40:00",
      "endsAt": "2023-04-28T12:25:00",
      "speakers": [
        "53bb8035-14c0-479a-9c9d-cc7c9b50c6ff",
        "fa6ac12a-6cbe-4dd0-8ee0-3d05ddbc2262"
      ],
      "roomId": 31081,
      "categoryItems": [
        158839,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "455676",
      "title": "App Clinic",
      "description": "A team of experts will come on stage and review a series of applications proposed by the audience.\r\n\r\nYou can send your application to app.clinic@androidmakers.fr (PlayStore link or APK)",
      "startsAt": "2023-04-28T10:40:00",
      "endsAt": "2023-04-28T12:25:00",
      "speakers": [
        "9f35aab3-8baf-4a74-97a0-735dd9a2479f"
      ],
      "roomId": 33634,
      "categoryItems": [
        158839,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "0fa7e624-76c5-44e0-8579-dbb2329f3385",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-28T11:25:00",
      "endsAt": "2023-04-28T11:40:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "456499",
      "title": "Off to the Races with Android",
      "description": "With the advent of modern 5G, single digits millisecond network latency is no longer a pipe dream, and on public networks, you can typically get 40ms to 50ms latency. To create buzz around these performance numbers, Bell 5G/MEC Innovation Lab came to us with an exciting project proposition: Create a remote-presence, high-performance model car racing experience for the Montreal Formula One Grand Prix.\r\n\r\nWe will present our approach to building this unique experience using cutting-edge technologies such as computer vision, machine learning and real-time communication. We'll discuss the technical challenges we faced and our solutions. Our core pillar is an Android phone controlling customized microcontrollers over USB integrating multiple sensors. Supervising the races, an overseeing machine-learning model. We'll also have a rare look into the cell network hardware needed to keep everything responsive and exciting.\r\n\r\nThis talk should be of interest to Android developers, robotics and IoT enthusiasts, as well as ML specialists looking for novel ways to combine the use of these technologies.",
      "startsAt": "2023-04-28T11:40:00",
      "endsAt": "2023-04-28T12:25:00",
      "speakers": [
        "878ec0bb-f4d7-4b83-a9af-ff6e359a35dc",
        "8f01dc41-f26d-41d9-a12d-1801e80795cf"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "417890",
      "title": "Level up on Kotlin Multiplatform",
      "description": "Kotlin Multiplatform is a new cross-platform technology from JetBrains that is taking the mobile world by storm. Many Android and iOS developers have given this exciting technology a try. But how do you take your skills from building simple apps to more complex ones?\r\n\r\nThis talk aims to help mobile developers level up their Kotlin Multiplatform skills by introducing libraries such as Ktor, SQLDelight, and Koin. I will also discuss implementing common architectural patterns such as MVVM, MVI, and Clean. By the end of the talk, the audience will have a richer understanding of how to build complex Kotlin Multiplatform apps.",
      "startsAt": "2023-04-28T11:40:00",
      "endsAt": "2023-04-28T12:25:00",
      "speakers": [
        "62216efe-dd8b-4d8b-9800-1d51b57c4001"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "9cfd7417-4060-49cc-9eed-8bad800ee158",
      "title": "Lunch",
      "description": null,
      "startsAt": "2023-04-28T12:25:00",
      "endsAt": "2023-04-28T14:00:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "450710",
      "title": "Confetti: building a Kotlin conference app in 40min 🎊",
      "description": "In this talk Martin and John will live code the development of Confetti, a fullstack conference app using a graphql-kotlin backend and KMM based mobile clients\r\n\r\nThe talk will cover\r\n- development of the graphql-kotlin backend\r\n- use of Apollo library and it's Kotlin Multiplatform support allowing addition of GraphQL queries and related logic in code shared between iOS and Android clients.\r\n- development of mobile clients that consume the shared KMM code (using Jetpack Compose on Android and SwiftUI on iOS)",
      "startsAt": "2023-04-28T14:00:00",
      "endsAt": "2023-04-28T14:45:00",
      "speakers": [
        "0392772c-28d4-47f6-bd39-47d743fb4a81",
        "56fda597-4927-4d25-9a80-4795d15ef080"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158842,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "439280",
      "title": "Are your secrets secure - How mobile apps are leaking millions of credentials",
      "description": "Secrets like API keys, security certificates and other credentials are the crown jewels of our applications. They give access to our most sensitive information and systems like databases, cloud infrastructure and third-party services. Despite being highly sensitive, these secrets are being leaked in our source code and compiled mobile applications. \r\n\r\nThroughout the presentation, we will analyze two in-depth research projects to show how mobile applications and specifically android applications are leaking secrets. The presentation will be broken into three sections:\r\n\r\n**Part 1 - How attackers find and exploit secrets**\r\nWe break down a collection of real-life breaches where hackers discovered and exploited credentials to gain unlawful access to different services. How the credentials were discovered, how they were exploited, and what the attackers were able to access / control.\r\n\r\n**Part 2 - Secrets in source code**\r\nGitGuardian's 2022 State of Secrets Sprawl report showed more than 6 million secrets were leaked publicly through source code in 2021 on GitHub.com. This number increased again in the (yet to be released) 2023 State of Secrets Sprawl Report. We will focus specifically on how many secrets were discovered inside android projects including the total number of secrets found, common secrets discovered, and common files containing plain text secrets. \r\n\r\n**Part 3 - Secrets on the play store**\r\nThe third section will review research into how many mobile applications on the Google Play Store are leaking secrets. The research reviews nearly 50,000 apk files which were downloaded from the Play Store and decompiled to reveal how many contained secrets. We show the overwhelming percentage of apps that contained plain text secrets and the types of secrets commonly found. \r\n\r\nTogether these sections show that attackers are actively trying to find and exploit secrets in our applications and reveal two predominant ways they are getting leaked in public places. The presentation will finish with actionable steps developers can take to prevent secrets from leaking. \r\n",
      "startsAt": "2023-04-28T14:00:00",
      "endsAt": "2023-04-28T14:45:00",
      "speakers": [
        "4e52cb59-2074-4f77-ad95-1f7c36f3bb28"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158842,
        158845,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "454559",
      "title": "State of Bluetooth LE on Android in 2023",
      "description": "It's 2023 and we've had Bluetooth LE APIs on Android for almost 10 years. Are they stable now? Can you work with them? Why is this so difficult? In this session you'll learn how to use BLE on Android and how to avoid the common pitfalls. This session is useful for anyone doing anything around Bluetooth connectivity on Android.",
      "startsAt": "2023-04-28T14:00:00",
      "endsAt": "2023-04-28T14:45:00",
      "speakers": [
        "79823093-1b16-4a2b-b0a9-ea4cd25b92f5"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "455173",
      "title": "~/git --help",
      "description": "Have you ever had an issue with git? Don't know which git command to use? Is your git slow in a big mono repo project?\r\n\r\nIf you answered YES to any of these questions, this talk is for you. First we will learn how git works under the hood which will give us a better understanding of several git commands. Second we will dive into the git features on Android Studio. Last but not least, share some tips on how to make the most out of git.\r\n\r\nAfter this talk, you will have the right knowledge to master git. Once you start to understand it, the terminology will make more sense and you’ll eventually learn to love it!",
      "startsAt": "2023-04-28T14:00:00",
      "endsAt": "2023-04-28T14:45:00",
      "speakers": [
        "1ee57fa9-790a-4a61-a980-6ef301818aea"
      ],
      "roomId": 33634,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "a53f543c-f61e-46d5-8982-e86d4c1c2bf0",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-28T14:45:00",
      "endsAt": "2023-04-28T15:00:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "435622",
      "title": "The Art of KMP: how I learned backend development with Kotlin and why you should too",
      "description": "KMP is not only KMM. You can also build web and desktop apps! And Kotlin doesn’t only work for Android, as many may think. You can build a backend for your app.\r\n\r\nIf you’re looking for a side project or just curious, I would suggest you try backend development with Kotlin. When I was starting with KMPizza I had a number of questions:\r\n\r\n- Is it reasonable/worth it to start learning Backend development with Kotlin? May be there is something different from Kotlin? I've heard good things about Go. Or should I rather choose Java frameworks as they are more mature? \r\n \r\n- Which framework is good to choose for a beginner? Kotlin Spring probably benefits from the maturity of Java Spring, whereas I have seen and heard more about Ktor implementations. Also using Ktor in the client side in KMM may be a good addition to learning backend with Ktor. \r\n \r\n- Any tutorials/starter projects/guides/learning kits?\r\n \r\nIn this talk I’m going to share what answers I found and how I learned backend development with Kotlin.",
      "startsAt": "2023-04-28T15:00:00",
      "endsAt": "2023-04-28T15:25:00",
      "speakers": [
        "6a7c1f8a-784d-46be-8840-9cf519c4bc78"
      ],
      "roomId": 31079,
      "categoryItems": [
        158837,
        158841,
        158845,
        158849
      ],
      "isServiceSession": false
    },
    {
      "id": "417951",
      "title": "Migrate to Gradle version catalog and convention plugins",
      "description": "Gradle always has been hard to grasp because of multiple ways to do the same thing. With the project scaling and requirements increasing it is crucial to scale our build logic and support developers across the teams. This talk will cover how to migrate to Gradle centralized version catalogs and share some of the build logic as convention plugins. This method is adopted by AndroidX project, Now In Android, and many more.",
      "startsAt": "2023-04-28T15:00:00",
      "endsAt": "2023-04-28T15:25:00",
      "speakers": [
        "12052406-2d03-4184-95a1-1098d88b9ce8"
      ],
      "roomId": 31080,
      "categoryItems": [
        158837,
        158842,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "454354",
      "title": "Boostez votre application mobile grâce à ChatGPT",
      "description": "ChatGPT et L'intelligence artificielle en général sont en train de révolutionner notre monde. Chez WeMoms (le réseau social de la maternité) on exploite ces outils au maximum pour booster le développement de nos apps Android : \r\n\r\n- rédaction de contenu \r\n- sortie de nouvelles fonctionnalités et génération d'images\r\n- génération de code personnalisés\r\n\r\nLes possibilités sont infinis. \r\n\r\nOn vous propose de vous embarquer dans l'aventure à travers trois exemples intégrés à notre app Android : \r\n- la création d'un outil pour trouver le prénom de son bébé avec GPT-3\r\n- La génération d'un outil de recette de cuisine avec GPT-3 et Dall-E\r\n- L'ajout d'animation et de nouvelles pages dans l'app avec ChatGPT\r\n\r\n*et au fait : ce résumé est généré par ChatGPT XD ",
      "startsAt": "2023-04-28T15:00:00",
      "endsAt": "2023-04-28T15:25:00",
      "speakers": [
        "edfe420a-8175-4064-9f50-b77a64358dd6"
      ],
      "roomId": 31081,
      "categoryItems": [
        158837,
        158841,
        158846,
        158847
      ],
      "isServiceSession": false
    },
    {
      "id": "441204",
      "title": "Introduction à l'observabilité sur mobile",
      "description": "Avec la croissance de votre companie, de votre équipe, beaucoup de changements se produisent :\r\nPlus de développeurs, une plus grosse codebase, plus de chance d'avoir des bugs, plus d'utilisateurs, des attentes plus fortes, plus de cas de bords, plus de configurations possible, etc.\r\n\r\nVoici la stratégie et les outils que nous avons mis en place chez Spendesk pour garder un oeil sur ce qu'il se passe réellement en production dans nos apps mobiles:\r\n- Détecter un bug ou des erreurs avant que l'utilisateur ne nous contacte.\r\n- Surveiller le comportement des features\r\n- Performances des app et des différentes fonctionnalités\r\n",
      "startsAt": "2023-04-28T15:00:00",
      "endsAt": "2023-04-28T15:25:00",
      "speakers": [
        "7659a5f9-d376-4ddb-aa96-892b34f40c23",
        "9860a793-5622-47ae-83bc-61d1e9c0fa0e"
      ],
      "roomId": 33634,
      "categoryItems": [
        158837,
        158841,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "755c57b9-28f1-4fdc-97ff-af9743df578c",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-28T15:25:00",
      "endsAt": "2023-04-28T15:40:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "417949",
      "title": "10 years of Android Development: The Retrospective",
      "description": "Working in the Android Development since 2011 when I made my first apps on a Galaxy S with Froyo (2.2) and there was no Fragment, Holo design was beautiful and ActionBarSherlock was the big thing!\r\n\r\nLet's see how Android Development has evolved during this 10-years timeframe with the rise of Fragments, Material design, and now Kotlin and Jetpack Compose with fun anecdotes and code samples.",
      "startsAt": "2023-04-28T15:40:00",
      "endsAt": "2023-04-28T16:25:00",
      "speakers": [
        "462e6b97-01f9-44b1-864c-9d85bedf911b"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158844,
        158845,
        158847,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "431337",
      "title": "Les différentes stratégies de monétisation d'une application mobile",
      "description": "Il y a de nombreuses manières de monétiser une application mobile (Android, iOS...) :\r\n\r\n- Vendre son application sur les catalogues spécialisés (Google Play, Apple App Store, Amazon Appstore, etc.)\r\n- Intégrer des achats in-app (vendre du contenu virtuel, débloquer du contenu privilégié, etc.) ou une souscription régulière (paiement mensuel / annuel, etc.)\r\n- Intégrer du contenu publicitaire (bannières, interstitielles, publicités natives, publicités rewarded, etc.)\r\n- Entreprendre des partenariats (avec d'autres sociétés du même domaine d'activité)\r\n- Collecter et vendre les données de ses utilisateurs\r\n- Et bien d'autres encore.\r\n\r\nNous allons passer en revue ensemble ces différentes possibilités, grace à l'expérience que nous avons acquise avec nos propres applications (500k+ and 2M+ téléchargements)",
      "startsAt": "2023-04-28T15:40:00",
      "endsAt": "2023-04-28T16:25:00",
      "speakers": [
        "ae702dc9-e083-4643-b977-77b1f10cd26f",
        "85dc1d24-7fae-4f37-93f7-051b38f8a74d"
      ],
      "roomId": 31080,
      "categoryItems": [
        158838,
        158841,
        158846
      ],
      "isServiceSession": false
    },
    {
      "id": "453147",
      "title": "Animations avec Compose : rendez vos apps chat-oyantes",
      "description": "Quoi de plus vivant qu’une belle interface animée ? Les équipes design rivalisent d’ingéniosité pour permettre à l’utilisateur de mieux comprendre le fonctionnement d’une application, grâce, notamment, aux animations. \r\n\r\nMais le terme \"animation\" fait souvent peur aux développeur·se·s. Les keyframes, les interpolateurs, les translations… un charabia qui peut encourager l’équipe de dev à freiner et à limiter les designers sur leurs idées.\r\n\r\nEt si on vous disait qu’implémenter des animations, c’est pas si difficile ?\r\n\r\nAvec Compose, le \"nouveau\" framework UI de Google, c’est même plutôt simple quand on a assimilé les termes techniques. Vous ne les connaissez pas ? Pas de problème, on est là !\r\n\r\nEn partant d’une application certes mignonne mais plutôt statique, nous allons voir ensemble et en direct sur quels éléments jouer pour donner vie à vos écrans.\r\n\r\nNotre objectif : que vous soyez à l’aise et que vous deveniez moteur dans la conception artistique du projet en proposant des animations simples et surtout peu coûteuses.\r\nPas besoin d’être un·e grand·e créatif·ve pour réaliser des applications chatoyantes !",
      "startsAt": "2023-04-28T15:40:00",
      "endsAt": "2023-04-28T16:25:00",
      "speakers": [
        "33443e15-f66d-4f8a-848e-31da9db7ef68",
        "2e99f60c-b3db-48d0-a155-e50064d67d36"
      ],
      "roomId": 31081,
      "categoryItems": [
        158838,
        158842,
        158846,
        158849,
        158850
      ],
      "isServiceSession": false
    },
    {
      "id": "29093d9e-5c35-4ade-8c77-26f43f84487e",
      "title": "Break",
      "description": null,
      "startsAt": "2023-04-28T16:25:00",
      "endsAt": "2023-04-28T16:40:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    },
    {
      "id": "461149",
      "title": "Defensive Programming: The Best Software Development Methodology Ever Invented",
      "description": "Software practitioner methodology process organization experts and consultants Romain Guy and Chet Haase will present their latest idea as fact in this probably helpful and certainly billable session on defensive programming. Come. Sit. Watch. Learn (optional).",
      "startsAt": "2023-04-28T16:40:00",
      "endsAt": "2023-04-28T17:15:00",
      "speakers": [
        "05fa719f-1528-43ef-adf9-eca92f383262",
        "152f613f-841b-407d-9a65-3703ec2dfae2"
      ],
      "roomId": 31079,
      "categoryItems": [
        158838,
        158841,
        158845
      ],
      "isServiceSession": false
    },
    {
      "id": "9161e94d-fbac-44a7-826b-03b3ffea7a15",
      "title": "Closing",
      "description": null,
      "startsAt": "2023-04-28T17:15:00",
      "endsAt": "2023-04-28T17:25:00",
      "speakers": [
      ],
      "roomId": 31079,
      "categoryItems": [
      ],
      "isServiceSession": true
    }
  ],
  "speakers": [
    {
      "id": "791d1128-88d2-4f3f-9917-9e4c1f1ea961",
      "bio": "Working on Android ML at Google, including TFLite for Play Services ",
      "fullName": "Adrien Couque",
      "profilePicture": "https://sessionize.com/image/3c70-400o400o2-QTFm7PWFZM4NUUVNjpPVeu.png",
      "links": [
      ],
      "tagLine": "Engineer @Google"
    },
    {
      "id": "a82de654-53d7-4c16-989a-5efddf36983e",
      "bio": "Akshay Chordiya is Google Developer Expert for Android & Kotlin | Android Developer @ Tinder ❤️ and Kotlin Enthusiast.\r\nHe is an active community speaker who is mostly found talking about Android and Kotlin. He is an avid blogger and author of “Kotlin Blueprints” book and instructor at Caster.IO",
      "fullName": "Akshay Chordiya",
      "profilePicture": "https://sessionize.com/image/3f47-400o400o2-54-53d7-4c16-989a-5efddf36983e.80e8c68a-14d0-4ee8-8aa6-bb6b1f39936b.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Akshay_Chordiya"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/akshaychordiya/"
        }
      ],
      "tagLine": "Android Developer @ Tinder | Public Speaker | Kotlin Lover | Co-Author of Kotlin Blueprints"
    },
    {
      "id": "e79f9a2d-dd0a-4e40-bd83-57abdcc07147",
      "bio": "Alan is currently a Software Engineer at Buf working on Protobuf and generated code. Previously, Alan was a lead at Lyft for various teams including mobile networking: Protobuf, code generation, metrics, and Envoy Mobile. Along with his background in scaling organizations, Alan gravitates towards developer tooling problems and improving collaborative environments for engineers. \r\n\r\nOutside of Software, Alan does pottery and boulders for fun!",
      "fullName": "Alan Chiu",
      "profilePicture": "https://sessionize.com/image/fb9b-400o400o2-XYLzKPk6LbhzuBwLPbcxiy.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/awlchiu"
        },
        {
          "title": "Blog",
          "url": "https://github.com/buildbreaker/"
        }
      ],
      "tagLine": "Buf, Software Engineer. Ex-Lyft."
    },
    {
      "id": "c73c2377-026f-4b6a-b1f7-91a536c33c67",
      "bio": "Aleksandr is an experienced software developer with a rich background, in IT for more than 20 years. He worked with different stacks in backend, frontend and mobile fields, but since 2018 his main interest is Flutter. Aleksandr is a Flutter and Dart GDE and Head of Flutter Discipline in EPAM Systems.",
      "fullName": "Aleksandr Denisov",
      "profilePicture": "https://sessionize.com/image/d3f1-400o400o2-77-026f-4b6a-b1f7-91a536c33c67.b048a543-27ec-463d-9935-2536de713d68.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ShuregDenisov"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/aleks-denisov/"
        }
      ],
      "tagLine": "EPAM Systems, Chief Software Engineer, Flutter and Dart GDE"
    },
    {
      "id": "ae702dc9-e083-4643-b977-77b1f10cd26f",
      "bio": "Anthony STEPHAN GUILLOTEAU\r\nAS Mobile Development\r\nSenior Android Developer, I work with Android devices since 2010 and I develop applications since 2012. Based on the experience I've gathered for the 10 past years, I went through multiple company size, from the start-up to the multinational, from the french pure-player to the international environment, then I founded my own company to develop, publish and sell my own applications and to strengthen Android teams as a freelance developer.\r\nHaving worked on multiple products, I've accompanied the creation of B2B and B2C applications, but also SDKs and low-level apps.\r\nhttps://printoid.net/\r\nhttps://play.google.com/store/apps/details?id=fr.yochi76.printoid.phones.premium",
      "fullName": "Anthony Stéphan Guilloteau",
      "profilePicture": "https://sessionize.com/image/db95-400o400o2-BySvXDg2WbvDNQX1jPGtYL.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/stephananthony/"
        },
        {
          "title": "Blog",
          "url": "https://asmobile.dev/blog/"
        },
        {
          "title": "Company Website",
          "url": "https://asmobile.dev/"
        }
      ],
      "tagLine": "Freelance, founder of AS Mobile Development, Senior Developer for TAG Heuer"
    },
    {
      "id": "33443e15-f66d-4f8a-848e-31da9db7ef68",
      "bio": "I am a mobile developer since Android 2.1 and iOS 4 😱 I used EventBus and loved to dealloc things (a lot).\r\n\r\nNow my tools are mainly Kotlin Multiplatform Mobile, Jetpack Compose and SwiftUI.\r\n\r\nMy passions are 🤘 metal music, 😻 cats, 📷 photography, 🎨 design and 📱 technology (no order).",
      "fullName": "Antoine Robiez",
      "profilePicture": "https://sessionize.com/image/b93f-400o400o2-e4471913-8a5b-4275-8b0c-95f8946794ff.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/enthuan"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/arobiez/"
        }
      ],
      "tagLine": "Mobile Tech Lead @ Worldline"
    },
    {
      "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
      "bio": "Google Developer Expert for Android, enthusiastic speaker, senior engineer at Snapp Mobile, Kotlin aficionado, spends more time travelling than working (he/him)",
      "fullName": "Ash Davies",
      "profilePicture": "https://sessionize.com/image/7162-400o400o2-3sSDTUEzJHmdfEFfg8AvLq.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/askashdavies"
        },
        {
          "title": "Blog",
          "url": "https://ashdavies.dev/"
        },
        {
          "title": "Company Website",
          "url": "https://snappmobile.io/"
        }
      ],
      "tagLine": "Senior Android Developer @ Snapp Mobile GmbH"
    },
    {
      "id": "2e99f60c-b3db-48d0-a155-e50064d67d36",
      "bio": "I like puzzles, meditation, sunsets, cats and kung-fu. And otherwise I enjoy discovering new versions of Compose, automating tasks, Clean Architecture and KMM.",
      "fullName": "Baptiste Carlier",
      "profilePicture": "https://sessionize.com/image/bd08-400o400o2-UjhjPEcN6qHJwFGA5a83mV.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://www.twitter.com/@bapness"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/baptiste-carlier-a3b9a91b"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@BapNesS"
        }
      ],
      "tagLine": "Android Tech Lead @Decathlon"
    },
    {
      "id": "5f8860b3-e669-4717-91bf-ddceb872fd55",
      "bio": "Developer, Presenter/Teacher, Open source advocate, Ultimate frisbee player & Board game hoarder.\r\nI love the fact that I get to code for a living, but I am also incredibly passionate about sharing, collaborating and helping others on their dev journey!\r\nI also have a growing YouTube channel (youtube.com/benkadel), where I try to make entertaining & educational content about programming, the tech industry and specific tutorials to breakdown complex topics.\r\nI adore presenting, story-telling and just generally engaging with an audience. If I am able to make life, even just a little brighter for someone then I have succeeded!",
      "fullName": "Benjamin Kadel",
      "profilePicture": "https://sessionize.com/image/7055-400o400o2-aeGKNNAdBRPbU7XJa8CVih.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Ben_Kadel"
        },
        {
          "title": "LinkedIn",
          "url": "https://uk.linkedin.com/in/benkadel"
        },
        {
          "title": "Blog",
          "url": "https://kardelio.github.io/"
        },
        {
          "title": "Company Website",
          "url": "https://www.babbel.com/"
        }
      ],
      "tagLine": "Senior Android Developer at Babbel"
    },
    {
      "id": "449b4215-55cc-444f-8ff4-b0c434a96019",
      "bio": "Android at Cash App.",
      "fullName": "Benoit Quenaudon",
      "profilePicture": "https://sessionize.com/image/2ca9-400o400o2-15-55cc-444f-8ff4-b0c434a96019.0cde7eba-d569-4f65-85b6-7a08c64ed67a.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/oldergod"
        },
        {
          "title": "Blog",
          "url": "https://benoitquenaudon.com/"
        },
        {
          "title": "Company Website",
          "url": "https://quenaudon.com/"
        }
      ],
      "tagLine": "Cash App"
    },
    {
      "id": "2bc1e95f-1243-4ad0-8a11-75541fee10e0",
      "bio": "Carlos Mota is an Android GDE. He can easily be spotted either working on Android applications written in Kotlin or developing them along with Kotlin Multiplatform. An enthusiastic about new technology and always trying to reach those last 20% of all of his side projects that seem to be really far away. He loves to share his knowledge with others either by giving talks, teaching, writing, or along with a cold beer in the nearest pub. GDG Coimbra organizer and Kotlin evangelist, he also has a huge passion for travel, photography, space, and the occasional run.",
      "fullName": "Carlos Mota",
      "profilePicture": "https://sessionize.com/image/efb7-400o400o2-LBdmtKWRMREWCH8VNkXXZ2.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/@cafonsomota"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/cafonsomota/"
        },
        {
          "title": "Blog",
          "url": "https://cafonsomota.xyz/"
        }
      ],
      "tagLine": "Lead Software Engineer at Avancee Software"
    },
    {
      "id": "a20010e8-b898-465f-84c8-69d93ae46194",
      "bio": "I have always been in love with the concept of having my own product in my pocket, and when I met Android it was a perfect match. \r\nI started working on Android almost 10 years ago (hello ActionBarSherlock), and I haven't quit since ! \r\nI now work at MWM, where we are challenged everyday with native and home-made tech (drawing, audio) to integrate in our various apps, while keeping up with quality standards.\r\n",
      "fullName": "Cécile Dreyfus",
      "profilePicture": "https://sessionize.com/image/3dcc-400o400o2-U4hjkiqNYa1ADeEdHogkhR.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/cecile-dreyfus-8b11ba81/"
        },
        {
          "title": "Company Website",
          "url": "https://mwm.io/"
        }
      ],
      "tagLine": "MWM - Android developer"
    },
    {
      "id": "05fa719f-1528-43ef-adf9-eca92f383262",
      "bio": "Chet has been on the Android team since 2010, as an engineer and then the lead for the UI Toolkit team, then as Chief Android Advocate on the Developer Relations team, and now as an engineer again on the Android Graphics team. He enjoys hacking code for graphics, UI, performance, and then talking to developers about it at conferences like this.",
      "fullName": "Chet Haase",
      "profilePicture": "https://sessionize.com/image/8d80-400o400o2-9f-1528-43ef-adf9-eca92f383262.ad51b0e2-257a-40de-a457-8ba542d27967.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/chethaase"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/chethaase/"
        },
        {
          "title": "Blog",
          "url": "https://chethaase.medium.com/"
        },
        {
          "title": "Company Website",
          "url": "http://d.android.com"
        }
      ],
      "tagLine": "Graphics Engineer"
    },
    {
      "id": "4d3a31b1-61e5-4a26-9ca3-c9f30e3eaa08",
      "bio": "Danny built mobile applications for companies like Viacom, Groupon, eBay and Alcatel. He is a Google Developer Expert for Android and Kotlin. Before there was Android he was already active in the Blackberry development community.",
      "fullName": "Danny Preussler",
      "profilePicture": "https://sessionize.com/image/e5a4-400o400o2-b1-61e5-4a26-9ca3-c9f30e3eaa08.3e7b5602-cf0d-4f47-b510-f789a00b4cbf.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/PreusslerBerlin"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/danny-preussler-557a3b79/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@dpreussler"
        },
        {
          "title": "Company Website",
          "url": "http://www.sporttotal.tv/"
        }
      ],
      "tagLine": "Android Lead @ Soundcloud"
    },
    {
      "id": "edfe420a-8175-4064-9f50-b77a64358dd6",
      "bio": "I am an Android developer passionate about new technologies for over 10 years. I have gained solid experience in mobile development and have worked on a variety of projects in different fields.\r\nI am also very active on YouTube (\"David Silvera\" channel), where I have a channel dedicated to mobile development with over 12000 subscribers. I love sharing my knowledge with other developers and helping people understand the latest trends in mobile development.\r\nI have already given live talks on my YouTube channel as well as for Flutter events in Africa and for AsynConf.",
      "fullName": "David Silvera",
      "profilePicture": "https://sessionize.com/image/e9f9-400o400o2-h5h8r5pFmhyKCMbwJ62USd.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/dav_silvera"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/david-silvera-87073271/"
        },
        {
          "title": "Blog",
          "url": "https://www.youtube.com/channel/UCHYsJlzg-8MBpskWQd95GxA"
        },
        {
          "title": "Company Website",
          "url": "https://www.wemoms.fr"
        }
      ],
      "tagLine": "Lead Android developer at WeMoms"
    },
    {
      "id": "944b39a5-752a-40e4-aa2b-dcc8e0f6da38",
      "bio": "Deema is a backend software engineer working on supporting core RevenueCat functionality across various app stores. Prior to that, she was at Microsoft were she built cloud services that scaled to billions of customers. ",
      "fullName": "Deema AlShamaa",
      "profilePicture": "https://sessionize.com/image/0200-400o400o2-UtCknRGfYqifh2m49Rqb4i.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/deemaalshamaa/"
        }
      ],
      "tagLine": "Software Engineer"
    },
    {
      "id": "b88bee58-a4e3-4a47-be4d-85c9421457cc",
      "bio": "Edouard has discovered Flutter in 2018 and totally fell in love with the framework. He is the cofounder of the Flutter Paris meetup and also one of the organizers of the Paris Android User Group.",
      "fullName": "Edouard Marquez",
      "profilePicture": "https://sessionize.com/image/289e-400o400o2-wRBhQCXUpnYXVPtUgBES5j.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/g123k"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/edouard-marquez-32431514"
        },
        {
          "title": "Company Website",
          "url": "https://www.youtube.com/@devcafe"
        }
      ],
      "tagLine": "Android & Flutter Developer"
    },
    {
      "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
      "bio": "Elaine has been working with mobile apps development for the past 6 years. Since the launch of the Google Assistant, she has been following the developments around that area. She truly believes that interacting with technology using natural language will define the future of computing. Born and raised in Brazil, she's been living in France since 2004 and loves everything multicultural. She's a GDE for the Google Assistant.",
      "fullName": "Elaine Dias Batista",
      "profilePicture": "https://sessionize.com/image/ff12-400o400o2-4gLzg9xVX7gjs6MEgxucCk.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/elainedbatista"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/elaine-dias-batista-25517520/"
        },
        {
          "title": "Blog",
          "url": "https://twitter.com/elainedbatista"
        },
        {
          "title": "Company Website",
          "url": "https://sfeir.com/"
        }
      ],
      "tagLine": "Team Leader at SFEIR"
    },
    {
      "id": "2f606e32-997a-4b74-8420-76a47e7d66a3",
      "bio": "Enrique López Mañas is a Google Developer Expert and independent IT consultant. He has been working with mobile technologies and learning from them since 2007. He is an avid contributor to the open source community and a FLOSS (Free Libre Open Source Software) kind of guy, being among the top 10 open source Java contributors in Germany. He is a part of the Google LaunchPad accelerator, where he participates in Google global initiatives to influence hundreds of the best startups from all around the globe. He is also a big data and machine learning aficionado.\r\n\r\nIn his free time he rides his bike, take pictures, and travels until exhaustion. He also writes literature and enjoys all kinds of arts. He likes to write about himself in third person. You can follow him on Twitter (@eenriquelopez) to stay updated on his latest movements.",
      "fullName": "Enrique Lopez Manas",
      "profilePicture": "https://sessionize.com/image/77a9-400o400o2-M9BKbgGqa4gZZzTjWuUY45.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "http://www.twitter.com/eenriquelopez"
        },
        {
          "title": "LinkedIn",
          "url": "https://de.linkedin.com/in/eenriquelopez"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@enriquelopezmanas"
        }
      ],
      "tagLine": "Google Developer Expert"
    },
    {
      "id": "79823093-1b16-4a2b-b0a9-ea4cd25b92f5",
      "bio": "Erik was raised in the dark woods of Sweden, where the was nothing to do but to learn how to write code for PCs. After many years of suffering through experiences of early C++, Visual basic, Delphi, and every version of Java and C#, he has now found Kotlin and feel comfortable that the future for software is bright again.",
      "fullName": "Erik Hellman",
      "profilePicture": "https://sessionize.com/image/ec6f-400o400o2-93-1b16-4a2b-b0a9-ea4cd25b92f5.4cc61ad2-1d12-4dab-81b4-6c2818bbe6de.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/ErikHellman"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/erikhelllman/"
        },
        {
          "title": "Blog",
          "url": "https://www.hellsoft.se"
        },
        {
          "title": "Company Website",
          "url": "https://hellsoft.se/"
        }
      ],
      "tagLine": "Severely colourblind, coffee addicted, mistake driven developer."
    },
    {
      "id": "878ec0bb-f4d7-4b83-a9af-ff6e359a35dc",
      "bio": "Etienne started his career as a back-end developer and pivoted to mobile development in the early 2010s. He worked on all tiers (server, web, mobile, and embedded) of large-scale software platforms and is currently a freelance software development consultant. \r\n\r\n- Developer on the Nina™ Mobile speech recognition SDK for Nuance Communications\r\n- Android team lead on TrueKey™ password management app for Intel / McAfee.\r\n- Senior Android developer on Hatchful™ Logo Maker, Shopify.\r\n- Staff developer for e-commerce store management application, Shopify.\r\n\r\nSince pivoting to mobile development, Etienne has been an active community member and regularly devotes his time to mentoring startups, developers and students in the space. He lives in Montreal with his wife and daughter and speaks French and English fluently. ",
      "fullName": "Etienne Caron",
      "profilePicture": "https://sessionize.com/image/881d-400o400o2-3XyABod1tzM94rrtZk4Mpg.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kanawish"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/etcaron"
        },
        {
          "title": "Blog",
          "url": "https://kanawish.com"
        },
        {
          "title": "Company Website",
          "url": "https://kanastruk.com"
        }
      ],
      "tagLine": "Freelance Software Developer / Consultant"
    },
    {
      "id": "9f35aab3-8baf-4a74-97a0-735dd9a2479f",
      "bio": "- Android Lead at TAG Heuer\r\n- Treasurer at the Paris Android User Group\r\n- Co-organizer of Android Makers in Paris\r\n- Google Developer Expert\r\n\r\nI've been working with Android since 2009. I took part of several R&D projects at french internet providers, then at Samsung in the Android B2B team, I also built an Android set-top box for a hotel chain, worked several years on Genymotion, an Android emulator. Then I joined Qonto a French B2B bank to build their Android app. And in 2019 I joined TAG Heuer to build their connected watches and ecosystem.",
      "fullName": "Eyal Lezmy",
      "profilePicture": "https://sessionize.com/image/21f2-400o400o2-Ry3ZC4o4Tx8xVxCo6DYeuv.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Eyal_Lezmy"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/eyallezmy/"
        },
        {
          "title": "Blog",
          "url": "http://eyal.fr"
        },
        {
          "title": "Company Website",
          "url": "https://www.tagheuer.com"
        }
      ],
      "tagLine": "Android Lead @ TAG Heuer"
    },
    {
      "id": "0b1323da-2946-49de-be5c-e54d44e12325",
      "bio": "After a decade and a half of building mobile apps at Facebook and various startups in Paris, London and San Francisco, Fabien started his own company: Wolfia. They are building tools for mobile developers. He also co-created Hacked, a mobile coding game with more than a million downloads.",
      "fullName": "Fabien Devos",
      "profilePicture": "https://sessionize.com/image/a8e3-400o400o2-Wj69q9oRxA1N3nHxYPFATr.jpeg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Fabien_Devos"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/fabiendevos/"
        },
        {
          "title": "Blog",
          "url": "https://wolfia.com/blog"
        },
        {
          "title": "Company Website",
          "url": "https://wolfia.com"
        }
      ],
      "tagLine": "Founder at Wolfia"
    },
    {
      "id": "5f7faf69-dd61-4ad6-b6d8-0173cae292d8",
      "bio": "Fatih has studied Computer Engineering in his bachelor's degree. He got his master's degree in \"Natural Language Processing\" and he was a research assistant for 2 years. After that, he started working as a freelance mobile developer for 2 years. He joined DNB Bank as a Senior Android Developer and now he is an Android Lead in DNB Bank for Norway's top used finance app \"Mobilbank\" and the savings app \"Spare\".",
      "fullName": "Fatih Giriş",
      "profilePicture": "https://sessionize.com/image/0593-400o400o2-M5pgNeuj2M86joAE5FuHRt.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/fatih_grs"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/fgiris/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@girisfth"
        },
        {
          "title": "Company Website",
          "url": "https://www.dnb.no/en"
        }
      ],
      "tagLine": "Android Lead @DNB"
    },
    {
      "id": "f63fcbea-0846-4b5e-b174-e1e9a5359964",
      "bio": "Développeur mobile chez Geev, je suis touche-à-tout, passionné du développement mobile, des objets connectés et de DIY.\r\n\r\nAprès une première expérience dans le webdesign et le développement de serveurs, j'ai poursuivi ma route dans le développement d'applications Android.\r\n\r\nJe suis un grand enthousiaste des languages Kotlin et Dart.",
      "fullName": "Florent Blot",
      "profilePicture": "https://sessionize.com/image/d7d3-400o400o2-9UiDGtq6y9pnpCTJtE7pN8.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/twitdefllo"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/florent-blot-a1b72240/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@fllo"
        },
        {
          "title": "Company Website",
          "url": "https://www.geev.com"
        }
      ],
      "tagLine": "Android Developer @ Geev"
    },
    {
      "id": "8f01dc41-f26d-41d9-a12d-1801e80795cf",
      "bio": "Francois is an experienced IT professional with a degree in information technology engineering, a DEC in computer science, and an MBA. He has worked in various roles since 1998, including as a programmer analyst, system architect, team lead, web/mobile developer, and trainer. He is currently an Innovation lead at the 5G/MEC innovation lab at Bell, where he combines AI, AR/VR, cloud, and IoT solutions to benefit enterprise clients. Francois is also an active member of the IT community in Montreal and has given talks on various IT topics. His strengths include innovation, creativity, communication, and project leadership.",
      "fullName": "François Légaré",
      "profilePicture": "https://sessionize.com/image/6ed7-400o400o2-fhFKHZRUbq8jCawt2En39E.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/flegare/"
        },
        {
          "title": "Company Website",
          "url": "https://www.bell.ca"
        }
      ],
      "tagLine": "Innovation service lab lead"
    },
    {
      "id": "23c58f10-a1d1-4c3d-aa8c-caed84503b97",
      "bio": "Fell in love with Android since I had my first smartphone (Gingerbread <3), I dreamed to develop an application used by millions of people. At MWM, I developed several applications matching this wish ! I like to develop beautiful UI but also to write native code in C++ with Android NDK to maximize performance of algorithms.",
      "fullName": "Frédéric Torcheux",
      "profilePicture": "https://sessionize.com/image/f40d-400o400o2-6tA5YAbkoZp2fvfba26fu.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/bowser_f"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/fr%C3%A9d%C3%A9ric-torcheux-411a9b7b/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@bowser-f"
        },
        {
          "title": "Company Website",
          "url": "https://mwm.io/"
        }
      ],
      "tagLine": "MWM - Android developer"
    },
    {
      "id": "6520ad1e-8c4e-45c1-b34d-91ca73db27fe",
      "bio": "Father and husband · Google Developer Expert for Android · Software Staff Engineer at Decathlon · GDG Lille (Android), FRAUG and Devfest Lille organizer · Disney Fan!",
      "fullName": "Gerard Paligot",
      "profilePicture": "https://sessionize.com/image/1edb-400o400o2-EkWYD7sV7VvtFAKoYk7xZz.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/GerardPaligot"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/gpaligot/"
        },
        {
          "title": "Blog",
          "url": "https://gerard.paligot.com/"
        },
        {
          "title": "Company Website",
          "url": "https://technology.decathlon.com/"
        }
      ],
      "tagLine": "Decathlon, Mobile Staff Engineer"
    },
    {
      "id": "3d34325b-8080-415c-9324-b06d036c5cab",
      "bio": "I'm a Flutter enthusiast for personal and professional projects and the author of the Flutter Favorite's `location` library. Currently working at Invertase on the FlutterFire project.",
      "fullName": "Guillaume Bernos",
      "profilePicture": "https://sessionize.com/image/4de3-400o400o2-WDnjsp8rpPdT5f7LiJ2Naz.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/BeGuillaume"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/guillaume-bernos/"
        },
        {
          "title": "Blog",
          "url": "https://guillaume.bernos.dev"
        },
        {
          "title": "Company Website",
          "url": "https://invertase.io"
        }
      ],
      "tagLine": "Lead Developer FlutterFire"
    },
    {
      "id": "3ff1f933-847b-4e0d-8e01-c2ca21bbab5d",
      "bio": "Developer and creator of many things OSS, his passions includes Web Development and Software Architecture. Has authored a couple of books, a few courses and has been speaking at industry events for nearly 20 years. Currently at JetBrains leading the Developer Advocacy team. Spends as much time as he can writing code.",
      "fullName": "Hadi Hariri",
      "profilePicture": "https://sessionize.com/image/6c5f-400o400o2-33-847b-4e0d-8e01-c2ca21bbab5d.52718bff-e891-4158-8ba6-b2fe96ec270f.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/hhariri"
        }
      ],
      "tagLine": "Never believed in elevator pitches"
    },
    {
      "id": "60549250-148e-46a0-9868-f5d31b5f7499",
      "bio": "Mobile developer for [Pl@ntNet app](https://play.google.com/store/apps/details?id=org.plantnet) at INRIA, Montpellier, France\r\n\r\nPreviously:\r\n- lead android developer at Teads\r\n\r\nAlso a web developer and open source contributors: \r\n- [openfeedback.io](https://openfeedback.io)\r\n- [bataille.ovh](https://bataille.ovh)\r\n- more on [github](https://github.com/HugoGresse)\r\n\r\nCreator of Montpellier Android User Group, board member of Montpellier Tech Hub and co-organizer of SunnyTech \r\n\r\nPrevious talks: \r\n- 2022: https://www.youtube.com/watch?v=2uohyVURg-g\r\n\r\n\r\n\r\n",
      "fullName": "Hugo Gresse",
      "profilePicture": "https://sessionize.com/image/ff69-400o400o2-nZMJ9HVd27zsnoQ7z6mJBX.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/hugoGresse"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/hugogresse/"
        },
        {
          "title": "Company Website",
          "url": "https://plantnet.org"
        }
      ],
      "tagLine": "Mobile developer at Pl@ntNet"
    },
    {
      "id": "d74d249a-ce9e-4887-93a0-fa19d73a501d",
      "bio": "Android developer & tech expert @Deezer, passionate about Design System, libraries and code sharing.\r\n\r\n",
      "fullName": "Jean-Baptiste Vincey",
      "profilePicture": "https://sessionize.com/image/aef3-400o400o2-GJBmDHW3w3PmYNUsjrMege.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/JBVincey"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jbvincey/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@jbvincey"
        },
        {
          "title": "Company Website",
          "url": "https://deezer.io/"
        }
      ],
      "tagLine": "Android developer & tech expert @Deezer"
    },
    {
      "id": "b3770b77-c9c8-454d-8b7a-045ca1d66b7b",
      "bio": "Jeroen Mols is full stack developer at Plaid, a Google Developer Expert (GDE) in Android and an internationally recognized speaker. With a passion for complex systems and highly technical apps, Jeroen has helped realize four connected products, over 15 Android applications and is passionately learning React.\r\n\r\nHave a look at his portfolio https://jeroenmols.com",
      "fullName": "Jeroen Mols",
      "profilePicture": "https://sessionize.com/image/ec63-400o400o2-VDZYyXnRs4dHDtatTcPsdF.jpeg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/@molsjeroen"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jeroenmols/"
        },
        {
          "title": "Blog",
          "url": "https://jeroenmols.com/blog"
        },
        {
          "title": "Company Website",
          "url": "https://plaid.com/"
        }
      ],
      "tagLine": "Software Developer at Plaid and GDE"
    },
    {
      "id": "0392772c-28d4-47f6-bd39-47d743fb4a81",
      "bio": "John is a Kotlin GDE that has been developing Android apps since 2010. He worked on server side Java applications in the 2000s and desktop clients in the 1990s. He's also been exploring and advocating for all things Kotlin Multiplatform since 2018.",
      "fullName": "John O'Reilly",
      "profilePicture": "https://sessionize.com/image/48e7-400o400o2-HkquSQhsfczBGkrABwVTBc.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/joreilly"
        },
        {
          "title": "Blog",
          "url": "https://johnoreilly.dev/"
        },
        {
          "title": "Company Website",
          "url": "http://neat.no"
        }
      ],
      "tagLine": "Android Software Engineer @ Neat"
    },
    {
      "id": "13e3361f-310d-4d75-a593-bb3acfee08a7",
      "bio": "Hi, I'm Jonathan, french Android Engineer.\r\n\r\nMy passion since 2012 is to create apps I'm using daily. Be the client of your own product makes creation process easier.\r\n\r\nI love my job at Music World Media (MWM). Create, improve and monetize apps is great especially on \"creativity\" like drawing and DJ apps.\r\n\r\nAfter 5 yeas as Android developer and contribute to launch a dozen apps, it is with pleasure that I continue the journey with the best team as Android Lead @ MWM.",
      "fullName": "Jonathan Mercandalli",
      "profilePicture": "https://sessionize.com/image/bb60-400o400o2-a4WDgzpicSuSa2JUaruJBM.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/MercandalliJ"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/jonathan-mercandalli"
        },
        {
          "title": "Blog",
          "url": "https://mercandalli.com"
        },
        {
          "title": "Company Website",
          "url": "https://mwm.io"
        }
      ],
      "tagLine": "Android Lead at MWM"
    },
    {
      "id": "05385600-cf94-4333-afb3-0ebb5f9d0269",
      "bio": "Jordan is the Engineering Manager of the Mobile Team at JobTeaser. Passionate about mobile development and startups, he's an Android Engineer for 8 years now.",
      "fullName": "Jordan Dahnoun",
      "profilePicture": "https://sessionize.com/image/7687-400o400o2-EkQaohAtu31qVUUNk7rQqo.png",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://fr.linkedin.com/in/jordan-dahnoun-18a95974"
        },
        {
          "title": "Company Website",
          "url": "https://www.jobteaser.com"
        }
      ],
      "tagLine": "Mobile Engineering Manager at JobTeaser"
    },
    {
      "id": "8e90a4dc-33fc-4000-9bcb-802e45b50d87",
      "bio": "I'm Julie and I'm native of Brittany. \r\nStimulated by curiosity on technologies and innovation, I was seduced by the idea of creating applications that will make people life easier. I started on Android platform, then my thirst for discoveries made me experiment cross platform technologies such as Xamarin and Flutter.\r\n\r\nI like discovering things, meeting people, dancing and travelling whenever I have the opportunity !\r\nLike most people at Deezer, this is my passion for music and tech that lead me to join this creative and ambitious company ! \r\n\r\nLet's innovate, share, learn and have fun !",
      "fullName": "Julie Gléonnec",
      "profilePicture": "https://sessionize.com/image/3662-400o400o2-39cPwSVhuVuF7bRBtT5uV6.jpg",
      "links": [
      ],
      "tagLine": "Android developer @Deezer"
    },
    {
      "id": "462e6b97-01f9-44b1-864c-9d85bedf911b",
      "bio": "Into the Android world for more than 10 years, I experienced California the startup way of life before coming back to France. I am currently Lead Android Engineer at Aircall where we are building the best phone system for modern businesses. Alongside Android, I have a great interest in backend development with Kotlin and AR/VR technology. In 2021, I became an Android GDE to continue my journey to always share and learn with the Android community.\r\nIn my spare time, I am a world traveler and a beer lover always looking for the best IPAs!",
      "fullName": "Julien Salvi",
      "profilePicture": "https://sessionize.com/image/dd30-400o400o2-4NcyaNMS4awH1Zr87u5Gve.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/JulienSalvi"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/salvijulien/"
        },
        {
          "title": "Company Website",
          "url": "https://aircall.io/"
        }
      ],
      "tagLine": "Lead Android Engineer @ Aircall"
    },
    {
      "id": "7659a5f9-d376-4ddb-aa96-892b34f40c23",
      "bio": "Android dev since 2018, I love UI and performance improvement topics.\r\nI'm a full remote dev, I live in Lyon to be close to the mountains",
      "fullName": "Kelian Clerc",
      "profilePicture": "https://sessionize.com/image/58c8-400o400o2-Qq4cdoe6C1EL6CLGRPDnNo.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/clerc_kelian"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/k%C3%A9lian-clerc-854451107/"
        }
      ],
      "tagLine": "Android Software Engineer at Spendesk"
    },
    {
      "id": "c35f2359-2c5c-4b88-a4bc-024a6c025ce4",
      "bio": "Kinnera (she/her) is an Android Developer at ioki, working on platform features for the white label apps. After an electrical engineering degree, she worked in Tokyo with Android and React Native and was a Lead for WomenWhoCode Tokyo. A little over a year ago, she moved to Frankfurt and joined ioki. She believes sugar comes first and will not ask you to prove otherwise.",
      "fullName": "Kinnera Priya Putti",
      "profilePicture": "https://sessionize.com/image/c5fc-400o400o2-hgcsScqgaUkpD8DasH6npt.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/kinnerapriyap"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/kinnerapriyap/"
        },
        {
          "title": "Blog",
          "url": "https://www.kinnerapriyap.com/work/"
        },
        {
          "title": "Company Website",
          "url": "https://ioki.com/"
        }
      ],
      "tagLine": "Android developer at ioki"
    },
    {
      "id": "6a7c1f8a-784d-46be-8840-9cf519c4bc78",
      "bio": "Lena is an Android developer with curiosity for iOS. She got interested in mobile development during her computer science degree at TU Dresden and has been creating Android apps ever since. She is currently inspired by Kotlin Multiplatform Mobile and enjoys sharing her experience with it.  \r\n\r\nWhen she's not programming, Lena loves going on adventures, hiking around Europe, surfing, skiing, freediving and regaining strength with the best local cuisine she can find.",
      "fullName": "Lena Stepanova",
      "profilePicture": "https://sessionize.com/image/fc1d-400o400o2-NuhVipEg5WLgPyZL4TzmmE.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/hlnstep"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/lenastepanova/"
        },
        {
          "title": "Blog",
          "url": "http://hlnstepanova.github.io/kmpizza"
        },
        {
          "title": "Company Website",
          "url": "http://hlnstepanova.github.io"
        }
      ],
      "tagLine": "Mobile Developer"
    },
    {
      "id": "7c1cede6-5f59-46bb-ad1e-22b63758dae7",
      "bio": "I love reliable, efficient, and fun things.\r\nKotlin is my go-to tool to achieve that in software projects since 2016.\r\n\r\nI maintain a few successful open source projects like refreshVersions and Splitties, while seeking new problems to solve with new libraries.\r\n\r\nAlways trying to innovate, I am interested in a lot of technical subjects of all scales, and how they are linked, directly or not.\r\n\r\nI also specifically love commuting by recumbent bike, velomobiles, and lego technic.",
      "fullName": "Louis CAD",
      "profilePicture": "https://sessionize.com/image/9602-400o400o2-8uv1o8mW8uWPvgF1vEKUh.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/Louis_CAD"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/louiscad"
        },
        {
          "title": "Blog",
          "url": "https://blog.louiscad.com/"
        }
      ],
      "tagLine": "Amande - Founder"
    },
    {
      "id": "bd3e3257-9d05-4f72-9225-50908473778d",
      "bio": "Lucas graduated from the Polytechnic School of the University of Sao Paulo with an Industrial Engineering degree. Prior to Wildlife Studios, he worked as a management consultant for over 3 years (most notably at Bain & Company). At Wildlife, Lucas has led several technical strategic initiatives, including the company's technical performance efforts where he helped all live games maintain a high technical bar. ",
      "fullName": "Lucas Klegen",
      "profilePicture": "https://sessionize.com/image/90c1-400o400o2-hWDvP7Vhkm9NuMGSUEHaFA.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/lucas-klegen-b9a851104/"
        },
        {
          "title": "Blog",
          "url": "https://wildlifestudios.com/unleash"
        },
        {
          "title": "Company Website",
          "url": "https://wildlifestudios.com/"
        }
      ],
      "tagLine": "Manager of Engineering Operations, Wildlife Studios"
    },
    {
      "id": "4e52cb59-2074-4f77-ad95-1f7c36f3bb28",
      "bio": "Mackenzie is a developer advocate with a passion for DevOps and code security. As the co-founder and former CTO of a health tech startup, he learnt first-hand how critical it is to build secure applications with robust developer operations. \r\nToday as the Developer Advocate at GitGuardian, Mackenzie is able to share his passion for code security with developers and works closely with research teams to show how malicious actors discover and exploit vulnerabilities in code. \r\n",
      "fullName": "Mackenzie Jackson",
      "profilePicture": "https://sessionize.com/image/28f3-400o400o2-TBJDeDf6YJAic3dCfEdDSs.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/advocatemack"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/advocatemack"
        },
        {
          "title": "Blog",
          "url": "https://blog.gitguardian.com/author/mackenziejackson/"
        },
        {
          "title": "Company Website",
          "url": "https://gitguardian.com "
        }
      ],
      "tagLine": "Developer advocate - Security fanatic "
    },
    {
      "id": "2313d8eb-7d6e-444d-8e8d-4d223f896ce8",
      "bio": "Mobile dev since Cupcake. Android GDE. Kotlin enthusiast. Dogs make me happy.",
      "fullName": "Maia Grotepass",
      "profilePicture": "https://sessionize.com/image/1d96-400o400o2-KpWLxBbuVa4M4Pg59vMrZj.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/maiatoday"
        }
      ],
      "tagLine": "Staff Engineer: Android principal at Luno"
    },
    {
      "id": "424072c4-ac7b-45e0-9d63-34903356b74c",
      "bio": "Hello, my name is Marc Picone, and I'm an Android developer with a passion for creating innovative and user-friendly apps.\r\n\r\nAfter starting my career in construction, I pursued my passion for graphic design and eventually found my way to Android app development\r\n\r\nCurrently, I work at MWM, a start-up that specialises in creating innovative music, drawing, and creative apps. As an Android developer at MWM, I find great joy in creating and improving apps that allow users to unleash their creativity and have fun while doing it.\r\n\r\nAs someone who loves to share my experiences and learn from others, I'm always looking to connect with other developers and enthusiasts. If you're interested in Android app development or have any questions for me, feel free to reach out!",
      "fullName": "Marc Picone",
      "profilePicture": "https://sessionize.com/image/1ac8-400o400o2-4ZF7ybY7cTPvHpFqvA69cy.png",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/marcpicone"
        },
        {
          "title": "Company Website",
          "url": "https://mwm.io/"
        }
      ],
      "tagLine": "Android software engineer at MWM"
    },
    {
      "id": "aeddc24f-0e47-4934-ad76-2de7a9dc9fac",
      "bio": "Marco is an Android engineer, currently working at TIER.  He is a Google Developer Expert for Kotlin, he loves Kotlin and he has experience with native Android and native iOS development, as well as cross-platform development with Flutter and Kotlin Multiplatform.\r\n\r\nIn his spare time, he writes and maintains open-source code, he shares his dev experience by writing on his blog, speaking at confs and organizing events with the Google Developer Group Venezia and he plays basketball.",
      "fullName": "Marco Gomiero",
      "profilePicture": "https://sessionize.com/image/0c60-400o400o2-JVg7XKCfJ2g8Pi1LyNPMPA.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/marcoGomier"
        },
        {
          "title": "LinkedIn",
          "url": "https://linkedin.com/in/marco-gomiero"
        },
        {
          "title": "Blog",
          "url": "https://www.marcogomiero.com"
        },
        {
          "title": "Company Website",
          "url": "https://www.tier.app/"
        }
      ],
      "tagLine": "Senior Android Engineer @ TIER"
    },
    {
      "id": "1fcef224-ed23-4d8d-8e07-4855817796fd",
      "bio": "SDK Developer @ RevenueCat",
      "fullName": "Mark Villacampa",
      "profilePicture": "https://sessionize.com/image/8be4-400o400o2-d8790599-4aa1-41d5-b4a1-494459caefd5.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/MarkVillacampa"
        },
        {
          "title": "Company Website",
          "url": "https://www.revenuecat.com/"
        }
      ],
      "tagLine": "SDK Developer @ RevenueCat"
    },
    {
      "id": "56fda597-4927-4d25-9a80-4795d15ef080",
      "bio": "Martin is a maintainer of Apollo Kotlin. He has been writing Android applications since Cupcake and fell in love with Kotlin in 2017. Martin loves naming things and the sound of his laptop fan compiling all these type-safe programs. When not busy rewriting all his bash scripts in Kotlin, Martin loves to hike the Pyrénées or play a good game of Hearthstone.",
      "fullName": "Martin Bonnin",
      "profilePicture": "https://sessionize.com/image/7c96-400o400o2-UiWeCMZDxPejrFsozKmLYr.jpeg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/martinbonnin"
        },
        {
          "title": "Blog",
          "url": "https://blog.mbonnin.net"
        },
        {
          "title": "Company Website",
          "url": "https://www.apollographql.com/"
        }
      ],
      "tagLine": "Mobile Engineer at ApolloGraphQL"
    },
    {
      "id": "12052406-2d03-4184-95a1-1098d88b9ce8",
      "bio": "Software Engineer with 8 years of experience, specializing in Android. An active contributor to AndroidX libraries. He is a fan of all things in software engineering. Out of work, Merab maintains an active podcast about work ethics and career growth and writes tech blogs. He is a GDG organizer and speaker at international conferences (DroidCon, DevFest, OWASP) and beyond. Community builder. Does 1:1 mentoring. Alongside his technological pursuits, he is an amateur cyclist and runner.\r\n\r\n\r\nreferences: \r\nhttps://www.droidcon.com/media-detail?video=491027100 - droidcon APAC 2020\r\nhttps://youtu.be/LLtzvEDqedM - DevFest Tbilisi/Vienna/Yerevan 2019\r\nhttps://youtu.be/9DVg2XymmSI?t=375 - Nullcon 2021\r\nhttps://youtu.be/KUzIGjxoMO0 - Software Development Webinar 2020\r\nhttps://youtu.be/LwEPvOx-2fU - OWASP Tbilisi 2020\r\nhttps://tatocaster.medium.com/\r\nhttps://debuggerpodcast.ge\r\n",
      "fullName": "Merab Tato Kutalia",
      "profilePicture": "https://sessionize.com/image/0a0c-400o400o2-ssJruY3q6U1zYEnJf1MhZH.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/TatoKutalia"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tatocaster"
        }
      ],
      "tagLine": "GDE for Android | GDG Tbilisi Organizer"
    },
    {
      "id": "ca3e1da2-cfce-4823-8e14-a886f2483c2c",
      "bio": "More than 10 years of experience with a broad range of computer expertise. Currently Android Developer at LeBonCoin. Author of Anti-Theft Security and Auxilium apps.",
      "fullName": "Morad Azzouzi",
      "profilePicture": "https://sessionize.com/image/8111-400o400o2-TgxqRZmk9KLRvxwYbYhq1R.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/MoradiousBig"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/morad-azzouzi-646725133/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@morad.azzouzi"
        },
        {
          "title": "Company Website",
          "url": "https://www.leboncoin.fr/"
        }
      ],
      "tagLine": "Android Developer at LeBonCoin"
    },
    {
      "id": "fa6ac12a-6cbe-4dd0-8ee0-3d05ddbc2262",
      "bio": "I'm a mobile developer for almost 10 years, I worked on all platforms and love to create apps.",
      "fullName": "Nicolas Rivière",
      "profilePicture": "https://sessionize.com/image/0026-400o400o2-hroHK41ctLEyMgP89BaN4w.jpeg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/riviere-nicolas/"
        },
        {
          "title": "Company Website",
          "url": "https://worldline.com/"
        }
      ],
      "tagLine": "Worldline. Mobile developer, lead dev"
    },
    {
      "id": "3192eb25-047c-4d7e-874a-53206c185074",
      "bio": "Hi, 👋🏼 I'm a full-stack mobile engineer.\r\n\r\nBio\r\n🧠 I work at viz.ai as a Senior Android Developer.\r\n👨🏼‍💻 I use daily .android .kotlin .co-routines .ConstraintLayout .room .mvvm\r\n📖 I created and maintain the Smart Siddur app\r\n\r\nNow\r\n📱 Currently learning iOS development\r\n✍🏼  Blogging (in Herbew) at androidoss.dev\r\n🎥  Making tutorials about Android dev on Youtube and TikTok.",
      "fullName": "Orel Zion",
      "profilePicture": "https://sessionize.com/image/d8a4-400o400o2-rsHjm3QqfryCxxSFfGHx64.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/orelziondev"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/orel-zion-86122665/"
        },
        {
          "title": "Blog",
          "url": "https://www.androidoss.dev/"
        }
      ],
      "tagLine": "Viz.ai Sr. Android Developer"
    },
    {
      "id": "62216efe-dd8b-4d8b-9800-1d51b57c4001",
      "bio": "Pamela is a Developer Advocate for Kotlin Multiplatform at JetBrains and has more than 20 years of experience writing desktop, web and mobile apps. ",
      "fullName": "Pamela Hill",
      "profilePicture": "https://sessionize.com/image/9e38-400o400o2-Dbh3jNbrkDNdSH1q1zAJmr.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/pamelaahill"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/pamelaahill/"
        },
        {
          "title": "Blog",
          "url": "https://www.pamelaahill.com"
        },
        {
          "title": "Company Website",
          "url": "https://www.jetbrains.com"
        }
      ],
      "tagLine": "Developer Advocate at JetBrains"
    },
    {
      "id": "97bc557b-01db-4ffc-813c-2c4c1a99500c",
      "bio": "Pier is a digital product designer who loves to push great ideas to life through a human-centered approach.\r\nHe has shaped digital products across different industries such as entertainment, banking and mobility.\r\nHe’s currently tackling new challenges as Design Lead at Snapp Mobile.",
      "fullName": "Pierluigi Rufo",
      "profilePicture": "https://sessionize.com/image/be15-400o400o2-4jBmDzCQrKhUz2nuCUYNNE.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/pierluigirufo"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/pierluigi-rufo-04299040/"
        },
        {
          "title": "Company Website",
          "url": "https://snappautomotive.io/"
        }
      ],
      "tagLine": "Design Lead at Snapp Mobile"
    },
    {
      "id": "b6dc4b56-ca5d-4e55-8a57-e37f6e6d6af0",
      "bio": "I am an android developer with 5+ years of experience, addicted to new things. I love clean architecture and clean, simple designs. I am trying to create meaningful articles and speeches. Currently composing and KMMing all the things.",
      "fullName": "Piotr Prus",
      "profilePicture": "https://sessionize.com/image/7cba-400o400o2-ainA1gVSSCHxugeFJdVjM2.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/piotr_prus"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/piotrprus/"
        },
        {
          "title": "Blog",
          "url": "https://piotrprus.medium.com/"
        }
      ],
      "tagLine": "Android developer"
    },
    {
      "id": "4674e36f-50f8-4ffb-a486-679d730c759e",
      "bio": "Based in Paris, Renaud likes sharing bad and good experiences on how to develop better softwares",
      "fullName": "Renaud Mathieu",
      "profilePicture": "https://sessionize.com/image/f208-400o400o2-2952bcff-8886-47d8-911d-b70321f9b768.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/renaud_mathieu"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/renaudmathieu1/"
        },
        {
          "title": "Blog",
          "url": "https://renaudmathieu.com"
        },
        {
          "title": "Company Website",
          "url": "https://proton.me/"
        }
      ],
      "tagLine": "Engineering Manager @ Proton, privacy by default"
    },
    {
      "id": "85dc1d24-7fae-4f37-93f7-051b38f8a74d",
      "bio": "Android developer for more than 8 years, I worked for several companies, in different domains and contexts. But my dream has always been to create my own company. For this, I developed some mobile apps and had the chance to make a living thanks to them.\r\n\r\nhttps://niamor.dev\r\n\r\nhttps://play.google.com/store/apps/details?id=dev.niamor.wearliveboxremote\r\nhttps://play.google.com/store/apps/details?id=dev.niamor.freeboxremote\r\nhttps://play.google.com/store/apps/details?id=dev.niamor.bboxremote\r\nhttps://play.google.com/store/apps/details?id=dev.niamor.androidtvremote",
      "fullName": "Romain Bouchaud",
      "profilePicture": "https://sessionize.com/image/abc0-400o400o2-ULH6yKYZUEJNL6tqaD1rRc.jpg",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/company/69714156/"
        },
        {
          "title": "Company Website",
          "url": "https://niamor.dev"
        }
      ],
      "tagLine": "Founder of NiamorDev"
    },
    {
      "id": "152f613f-841b-407d-9a65-3703ec2dfae2",
      "bio": "Romain manages the Android Toolkit team. The team's projects included AndroidX/Jetpack, the UI toolkit, Kotlin support and graphics.",
      "fullName": "Romain Guy",
      "profilePicture": "https://sessionize.com/image/bfdf-400o400o2-d068ae37-2e0e-49bd-a4be-b376a32367a8.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/romainguy"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/romainguy/"
        },
        {
          "title": "Blog",
          "url": "https://www.curious-creature.com"
        }
      ],
      "tagLine": "Android Toolkit"
    },
    {
      "id": "22ac76a5-35b4-478c-a2c6-f7b8a4169928",
      "bio": "Mobile engineer for 10 years in different scale-up. Interested mainly in pushing mobile application at scale and improve shift left in engineering.",
      "fullName": "Romain Rivollier",
      "profilePicture": "https://sessionize.com/image/95b1-400o400o2-36442303-ac79-49e0-891e-76668230573c.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/lypiut"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/romain-rivollier-92154a5a/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/jobteaser-dev-team"
        },
        {
          "title": "Company Website",
          "url": "https://www.jobteaser.com"
        }
      ],
      "tagLine": "Staff Engineer at Jobteaser"
    },
    {
      "id": "9a7f5add-ce7a-49a3-ab3d-f3c4484453e8",
      "bio": "Sinan is an Android GDE and he works as Staff Engineer at Delivery Hero, food delivery company. He has been working with Android since 2011 and has 11 years of professional experience with software development. He is passionate about Kotlin and loves to contribute open-source.",
      "fullName": "Sinan Kozak",
      "profilePicture": "https://sessionize.com/image/e07d-400o400o2-SPKGk1Vse2mophBVWYhs2c.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/snnkzk"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/sinankozak/"
        },
        {
          "title": "Blog",
          "url": "https://sinankozak.medium.com/"
        },
        {
          "title": "Company Website",
          "url": "https://www.deliveryhero.com/"
        }
      ],
      "tagLine": "Android Staff Engineer - Delivery Hero"
    },
    {
      "id": "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
      "bio": "Thomas Ezan is an Android Engineer. He is currently working in the Android Developer Relations Team at Google. Before joining Google he spent 6 years in Lyft’s Growth team and worked at Pocket and Eventbrite. He is currently based in Seattle, WA.",
      "fullName": "Thomas Ezan",
      "profilePicture": "https://sessionize.com/image/7453-400o400o2-09-8132-4ac8-91a5-9e7b293063a4.5bfff84a-3ddf-47af-a9ca-06baeb80662b.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/lethargicpanda"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/tezan/"
        },
        {
          "title": "Company Website",
          "url": "https://developer.android.com/ml"
        }
      ],
      "tagLine": "Android Developer Relations @Google"
    },
    {
      "id": "9860a793-5622-47ae-83bc-61d1e9c0fa0e",
      "bio": "Currently working at Spendesk, I'm building iOS apps for close to 10 years. My main driver is having a positive impact on my users so I strive for great user experiences while never compromising on the perceived quality.",
      "fullName": "Valentin Pertuisot",
      "profilePicture": "https://sessionize.com/image/523b-400o400o2-RRdQHT1oDbsJkibp1F7uER.png",
      "links": [
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/valentinpertuisot/"
        },
        {
          "title": "Company Website",
          "url": "https://spendesk.com"
        }
      ],
      "tagLine": "iOS Team lead at Spendesk"
    },
    {
      "id": "bf58d77f-fad3-49b7-a6b3-82b5f46e5549",
      "bio": "Xavier F. Gouchet is a Senior Software Engineer at Datadog, experienced public speaker, and proud father. Passionate about open source, testing and architecture, he has been dabbling in Android since the Cupcake days and has been working as a professional Android engineer since 2012. \r\n",
      "fullName": "Xavier F. Gouchet",
      "profilePicture": "https://sessionize.com/image/e663-400o400o2-LasSKnQhau826ivwXvp86V.png",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/xgouchet"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/xgouchet/"
        }
      ],
      "tagLine": "Senior Software Engineer at Datadog"
    },
    {
      "id": "53bb8035-14c0-479a-9c9d-cc7c9b50c6ff",
      "bio": "Yassine is a lead developer and teacher. He develops mobile apps during his daily job and teaches different subjects related to development and algorithms. He also has a PhD on the subject of computer vision.",
      "fullName": "Yassine Benabbas",
      "profilePicture": "https://sessionize.com/image/1bc3-400o400o2-35-14c0-479a-9c9d-cc7c9b50c6ff.c78822d9-1723-4c76-bdcb-e03d292c5fc2.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/yostane"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/benabbasyassine/"
        },
        {
          "title": "Blog",
          "url": "https://medium.com/@yostane"
        }
      ],
      "tagLine": "Worldline. Mobile developer,  lead  dev"
    },
    {
      "id": "1ee57fa9-790a-4a61-a980-6ef301818aea",
      "bio": "Zhenlei is an Android engineer at N26 developing the first mobile bank app in Europe. He was previously part of the team at Venturus in Brazil, where he also got the chance to work with various partners (Sony Mobile, Motorola, etc) on their Android projects.\r\n\r\nHe has not only been developing for Android since Gingerbread but he also contributed to the AOSP (Android Open Source Project) in the Android Framework UI/UX team. He also has experience with test automation.\r\n\r\nBesides that, he is an origami enthusiast that tries to fold a piece of paper in his spare time.\r\n",
      "fullName": "Zhenlei Ji",
      "profilePicture": "https://sessionize.com/image/e2bf-400o400o2-a9-790a-4a61-a980-6ef301818aea.5db3d4a0-ea4a-4268-aef6-771a82f9e73d.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "https://twitter.com/zhenleiji"
        },
        {
          "title": "LinkedIn",
          "url": "https://www.linkedin.com/in/zhenleiji"
        }
      ],
      "tagLine": "Android Engineer • Script Addicted • Origami Enthusiast"
    },
    {
      "id": "a733fc42-dcb9-4107-9675-70335f2889e9",
      "bio": "My pronouns are he / him. I'm currently working as an Android Distinguished Engineer at Square.",
      "fullName": "🍷Pierre-Yves Ricau",
      "profilePicture": "https://sessionize.com/image/c2f7-400o400o2-42-dcb9-4107-9675-70335f2889e9.676d3ed7-f28a-449d-92f7-25b8dffa8196.jpg",
      "links": [
        {
          "title": "Twitter",
          "url": "http://twitter.com/Piwai"
        },
        {
          "title": "Blog",
          "url": "https://hashnode.com/@py"
        }
      ],
      "tagLine": "Android Plumber"
    }
  ],
  "rooms": [
    {
      "id": 31079,
      "name": "Salle Mœbius",
      "sort": 0
    },
    {
      "id": 31080,
      "name": "Salle Blin",
      "sort": 1
    },
    {
      "id": 31081,
      "name": "Salle 2.02",
      "sort": 2
    },
    {
      "id": 33634,
      "name": "Salle 2.04",
      "sort": 3
    },
    {
      "id": 33635,
      "name": "Office Hours",
      "sort": 4
    }
  ],
  "categories": [
    {
      "id": 46973,
      "title": "Session format",
      "items": [
        {
          "id": 158837,
          "name": "Lightning talk",
          "sort": 1
        },
        {
          "id": 158838,
          "name": "Session",
          "sort": 2
        },
        {
          "id": 158839,
          "name": "Workshop",
          "sort": 3
        },
        {
          "id": 158840,
          "name": "Panel",
          "sort": 4
        }
      ]
    },
    {
      "id": 46974,
      "title": "Level",
      "items": [
        {
          "id": 158841,
          "name": "Introductory and overview",
          "sort": 1
        },
        {
          "id": 158842,
          "name": "Intermediate",
          "sort": 2
        },
        {
          "id": 158843,
          "name": "Advanced",
          "sort": 3
        },
        {
          "id": 158844,
          "name": "Keynote",
          "sort": 4
        }
      ]
    },
    {
      "id": 46975,
      "title": "Language",
      "items": [
        {
          "id": 158845,
          "name": "English",
          "sort": 1
        },
        {
          "id": 158846,
          "name": "French",
          "sort": 2
        }
      ]
    },
    {
      "id": 46976,
      "title": "Tags",
      "items": [
        {
          "id": 158847,
          "name": "Keynote",
          "sort": 1
        },
        {
          "id": 158848,
          "name": "Flutter",
          "sort": 2
        },
        {
          "id": 158849,
          "name": "Kotlin",
          "sort": 3
        },
        {
          "id": 158850,
          "name": "Google",
          "sort": 4
        }
      ]
    }
  ],
  "partners": [
    {
      "kind": "gold",
      "items": [
        {
          "name": "Embrace",
          "url": "https://embrace.io/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2022/10/embrace.png"
        },
        {
          "name": "RevenueCat",
          "url": "https://www.revenuecat.com/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/01/revenue-cat-1.png"
        },
        {
          "name": "MWM",
          "url": "https://mwm.io/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/02/Unknown-1.png"
        }
      ]
    },
    {
      "kind": "silver",
      "items": [
        {
          "name": "Vonage",
          "url": "https://developer.vonage.com/en/home",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2022/05/Vonage.png"
        }
      ]
    },
    {
      "kind": "startup",
      "items": [
        {
          "name": "Vonage",
          "url": "https://glassfy.io/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/03/glassfy.png"
        },
        {
          "name": "Koin",
          "url": "https://insert-koin.io/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/03/kotzilla.png"
        }
      ]
    },
    {
      "kind": "community",
      "items": [
        {
          "name": "StickerMule",
          "url": "https://www.stickermule.com/eu/uses/laptop-stickers?utm_source=google&utm_campaign=AndroidMakers23&utm_id=AndroidMakers23",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2022/05/Sticker-Mule.png"
        },
        {
          "name": "GroundBreaker",
          "url": "https://groundbreaker.org/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/03/groundbreaker.png"
        },
        {
          "name": "Women Techmakers",
          "url": "https://developers.google.com/womentechmakers",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2022/10/womentechmakers.png"
        }
      ]
    },
    {
      "kind": "party",
      "items": [
        {
          "name": "Datadog",
          "url": "https://www.datadoghq.com/product/real-user-monitoring/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/03/datadog.png"
        }
      ]
    },
    {
      "kind": "media",
      "items": [
        {
          "name": "Apiumhub",
          "url": "https://apiumhub.com/media-kit/",
          "photoUrl": "https://androidmakers.droidcon.com/wp-content/uploads/sites/5/2023/02/apiumhub.png"
        }
      ]
    }
  ],
  "venues": [
    {
      "id": "conference",
      "name": "Beffroi de Montrouge",
      "address": "Av. de la République, 92120 Montrouge",
      "imageUrl": "https://www.beffroidemontrouge.com/wp-content/uploads/2019/09/moebius-1.jpg"
    },
    {
      "id": "afterparty",
      "name": "Surprise",
      "address": "Coming soon 🍻",
      "imageUrl": "https://wallpapers.com/images/featured/1y550aojs77u58wk.jpg"
    }
  ]
}